ld527027363/ESP8266/proj/app/si4463/si446x_defs.h
/*!
 * Silicon Laboratories Confidential
 * Copyright 2011 Silicon Laboratories, Inc.
 *
 * THIS FILE IS AUTOMATICALLY GENERATED. DO NOT EDIT!
 */

#ifndef _SI446X_DEFS_H_
#define _SI446X_DEFS_H_


#include "si446x_bsp.h"

/* This section contains command map declarations */
struct si446x_reply_GENERIC_map {
    U8  REPLY1;
    U8  REPLY2;
    U8  REPLY3;
    U8  REPLY4;
    U8  REPLY5;
    U8  REPLY6;
    U8  REPLY7;
    U8  REPLY8;
    U8  REPLY9;
    U8  REPLY10;
    U8  REPLY11;
    U8  REPLY12;
    U8  REPLY13;
    U8  REPLY14;
    U8  REPLY15;
    U8  REPLY16;
};

struct si446x_reply_PART_INFO_map {
    U8  CHIPREV;
    UU16 PART;
    U8  PBUILD;
    UU16 ID;
    U8  CUSTOMER;
    U8  ROMID;
};

struct si446x_reply_FUNC_INFO_map {
    U8  REVEXT;
    U8  REVBRANCH;
    U8  REVINT;
    UU16 PATCH;
    U8  FUNC;
};

struct si446x_reply_GET_PROPERTY_map {
    U8  DATA0;
    U8  DATA1;
    U8  DATA2;
    U8  DATA3;
    U8  DATA4;
    U8  DATA5;
    U8  DATA6;
    U8  DATA7;
    U8  DATA8;
    U8  DATA9;
    U8  DATA10;
    U8  DATA11;
    U8  DATA12;
    U8  DATA13;
    U8  DATA14;
    U8  DATA15;
};

struct si446x_reply_GPIO_PIN_CFG_map {
    U8  GPIO0;
    U8  GPIO1;
    U8  GPIO2;
    U8  GPIO3;
    U8  NIRQ;
    U8  SDO;
    U8  GEN_CONFIG;
};

struct si446x_reply_GET_ADC_READING_map {
    UU16 GPIO_ADC;
    UU16 BATTERY_ADC;
    UU16 TEMP_ADC;
    U8  TEMP_SLOPE;
    U8  TEMP_INTERCEPT;
};

struct si446x_reply_FIFO_INFO_map {
    U8  RX_FIFO_COUNT;
    U8  TX_FIFO_SPACE;
};

struct si446x_reply_PACKET_INFO_map {
    U8  LENGTH_15_8;
    U8  LENGTH_7_0;
};

struct si446x_reply_IRCAL_map {
    U8  CAL_STATE;
    U8  RSSI;
    U8  DIR_CH;
};

struct si446x_reply_GET_INT_STATUS_map {
    U8  INT_PEND;
    U8  INT_STATUS;
    U8  PH_PEND;
    U8  PH_STATUS;
    U8  MODEM_PEND;
    U8  MODEM_STATUS;
    U8  CHIP_PEND;
    U8  CHIP_STATUS;
};

struct si446x_reply_GET_PH_STATUS_map {
    U8  PH_PEND;
    U8  PH_STATUS;
};

struct si446x_reply_GET_MODEM_STATUS_map {
    U8  MODEM_PEND;
    U8  MODEM_STATUS;
    U8  CURR_RSSI;
    U8  LATCH_RSSI;
    U8  ANT1_RSSI;
    U8  ANT2_RSSI;
    UU16 AFC_FREQ_OFFSET;
};

struct si446x_reply_GET_CHIP_STATUS_map {
    U8  CHIP_PEND;
    U8  CHIP_STATUS;
    U8  CMD_ERR_STATUS;
};

struct si446x_reply_REQUEST_DEVICE_STATE_map {
    U8  CURR_STATE;
    U8  CURRENT_CHANNEL;
};

struct si446x_reply_READ_CMD_BUFF_map {
    U8  CMD_BUFF0;
    U8  CMD_BUFF1;
    U8  CMD_BUFF2;
    U8  CMD_BUFF3;
    U8  CMD_BUFF4;
    U8  CMD_BUFF5;
    U8  CMD_BUFF6;
    U8  CMD_BUFF7;
    U8  CMD_BUFF8;
    U8  CMD_BUFF9;
    U8  CMD_BUFF10;
    U8  CMD_BUFF11;
    U8  CMD_BUFF12;
    U8  CMD_BUFF13;
    U8  CMD_BUFF14;
    U8  CMD_BUFF15;
};

struct si446x_reply_FRR_A_READ_map {
    U8  FRR_A_VALUE;
    U8  FRR_B_VALUE;
    U8  FRR_C_VALUE;
    U8  FRR_D_VALUE;
};

struct si446x_reply_FRR_B_READ_map {
    U8  FRR_B_VALUE;
    U8  FRR_C_VALUE;
    U8  FRR_D_VALUE;
    U8  FRR_A_VALUE;
};

struct si446x_reply_FRR_C_READ_map {
    U8  FRR_C_VALUE;
    U8  FRR_D_VALUE;
    U8  FRR_A_VALUE;
    U8  FRR_B_VALUE;
};

struct si446x_reply_FRR_D_READ_map {
    U8  FRR_D_VALUE;
    U8  FRR_A_VALUE;
    U8  FRR_B_VALUE;
    U8  FRR_C_VALUE;
};


/* The union that stores the reply written back to the host registers */
union si446x_cmd_reply_union {
    U8                                                                     RAW[16];
    struct si446x_reply_GENERIC_map                                        GENERIC;
    struct si446x_reply_PART_INFO_map                                      PART_INFO;
    struct si446x_reply_FUNC_INFO_map                                      FUNC_INFO;
    struct si446x_reply_GET_PROPERTY_map                                   GET_PROPERTY;
    struct si446x_reply_GPIO_PIN_CFG_map                                   GPIO_PIN_CFG;
    struct si446x_reply_GET_ADC_READING_map                                GET_ADC_READING;
    struct si446x_reply_FIFO_INFO_map                                      FIFO_INFO;
    struct si446x_reply_PACKET_INFO_map                                    PACKET_INFO;
    struct si446x_reply_IRCAL_map                                          IRCAL;
    struct si446x_reply_GET_INT_STATUS_map                                 GET_INT_STATUS;
    struct si446x_reply_GET_PH_STATUS_map                                  GET_PH_STATUS;
    struct si446x_reply_GET_MODEM_STATUS_map                               GET_MODEM_STATUS;
    struct si446x_reply_GET_CHIP_STATUS_map                                GET_CHIP_STATUS;
    struct si446x_reply_REQUEST_DEVICE_STATE_map                           REQUEST_DEVICE_STATE;
    struct si446x_reply_READ_CMD_BUFF_map                                  READ_CMD_BUFF;
    struct si446x_reply_FRR_A_READ_map                                     FRR_A_READ;
    struct si446x_reply_FRR_B_READ_map                                     FRR_B_READ;
    struct si446x_reply_FRR_C_READ_map                                     FRR_C_READ;
    struct si446x_reply_FRR_D_READ_map                                     FRR_D_READ;
};


#define SI446X_CMD_ID_NOP                                                      0x00
//NOP ARGS
#define SI446X_CMD_ARG_COUNT_NOP                                               1
//NOP REPLY
#define SI446X_CMD_REPLY_COUNT_NOP                                             0

#define SI446X_CMD_ID_PART_INFO                                                0x01
//PART_INFO ARGS
#define SI446X_CMD_ARG_COUNT_PART_INFO                                         1
//PART_INFO REPLY
#define SI446X_CMD_REPLY_COUNT_PART_INFO                                       8
    #define SI446X_CMD_PART_INFO_REP_CHIPREV_TYPE u8
    #define SI446X_CMD_PART_INFO_REP_CHIPREV_SIZE 8
    #define SI446X_CMD_PART_INFO_REP_CHIPREV_MASK 0xFF
    #define SI446X_CMD_PART_INFO_REP_CHIPREV_MSB  7
    #define SI446X_CMD_PART_INFO_REP_CHIPREV_LSB  0
    #define SI446X_CMD_PART_INFO_REP_CHIPREV_INDEX 1
    #define SI446X_CMD_PART_INFO_REP_PART_TYPE u16
    #define SI446X_CMD_PART_INFO_REP_PART_SIZE 16
    #define SI446X_CMD_PART_INFO_REP_PART_MASK 0xFFFF
    #define SI446X_CMD_PART_INFO_REP_PART_MSB  15
    #define SI446X_CMD_PART_INFO_REP_PART_LSB  0
    #define SI446X_CMD_PART_INFO_REP_PART_INDEX 2
    #define SI446X_CMD_PART_INFO_REP_PBUILD_TYPE u8
    #define SI446X_CMD_PART_INFO_REP_PBUILD_SIZE 8
    #define SI446X_CMD_PART_INFO_REP_PBUILD_MASK 0xFF
    #define SI446X_CMD_PART_INFO_REP_PBUILD_MSB  7
    #define SI446X_CMD_PART_INFO_REP_PBUILD_LSB  0
    #define SI446X_CMD_PART_INFO_REP_PBUILD_INDEX 4
    #define SI446X_CMD_PART_INFO_REP_ID_TYPE u16
    #define SI446X_CMD_PART_INFO_REP_ID_SIZE 16
    #define SI446X_CMD_PART_INFO_REP_ID_MASK 0xFFFF
    #define SI446X_CMD_PART_INFO_REP_ID_MSB  15
    #define SI446X_CMD_PART_INFO_REP_ID_LSB  0
    #define SI446X_CMD_PART_INFO_REP_ID_INDEX 5
    #define SI446X_CMD_PART_INFO_REP_CUSTOMER_TYPE u8
    #define SI446X_CMD_PART_INFO_REP_CUSTOMER_SIZE 8
    #define SI446X_CMD_PART_INFO_REP_CUSTOMER_MASK 0xFF
    #define SI446X_CMD_PART_INFO_REP_CUSTOMER_MSB  7
    #define SI446X_CMD_PART_INFO_REP_CUSTOMER_LSB  0
    #define SI446X_CMD_PART_INFO_REP_CUSTOMER_INDEX 7
    #define SI446X_CMD_PART_INFO_REP_ROMID_TYPE u8
    #define SI446X_CMD_PART_INFO_REP_ROMID_SIZE 8
    #define SI446X_CMD_PART_INFO_REP_ROMID_MASK 0xFF
    #define SI446X_CMD_PART_INFO_REP_ROMID_MSB  7
    #define SI446X_CMD_PART_INFO_REP_ROMID_LSB  0
    #define SI446X_CMD_PART_INFO_REP_ROMID_INDEX 8

#define SI446X_CMD_ID_POWER_UP                                                 0x02
//POWER_UP ARGS
#define SI446X_CMD_ARG_COUNT_POWER_UP                                          7
    #define SI446X_CMD_POWER_UP_ARG_BOOT_OPTIONS_TYPE bitfield
    #define SI446X_CMD_POWER_UP_ARG_BOOT_OPTIONS_SIZE 8
    #define SI446X_CMD_POWER_UP_ARG_BOOT_OPTIONS_MASK 0xFF
    #define SI446X_CMD_POWER_UP_ARG_BOOT_OPTIONS_MSB  7
    #define SI446X_CMD_POWER_UP_ARG_BOOT_OPTIONS_LSB  0
    #define SI446X_CMD_POWER_UP_ARG_BOOT_OPTIONS_INDEX 1
    #define SI446X_CMD_POWER_UP_ARG_BOOT_OPTIONS_value (((cmd.arg.RAW[1])))
    #define SI446X_CMD_POWER_UP_ARG_PATCH_TYPE bitfield
    #define SI446X_CMD_POWER_UP_ARG_PATCH_SIZE 1
    #define SI446X_CMD_POWER_UP_ARG_PATCH_MASK 0x80
    #define SI446X_CMD_POWER_UP_ARG_PATCH_BIT  0x80
    #define SI446X_CMD_POWER_UP_ARG_PATCH_MSB  7
    #define SI446X_CMD_POWER_UP_ARG_PATCH_LSB  7
    #define SI446X_CMD_POWER_UP_ARG_PATCH_INDEX 1
    #define SI446X_CMD_POWER_UP_ARG_PATCH_is_true (cmd.arg.RAW[1]&0x80)
    #define SI446X_CMD_POWER_UP_ARG_PATCH_value (((cmd.arg.RAW[1]&0x80))>>7)
    #define SI446X_CMD_POWER_UP_ARG_FUNC_TYPE bitfield
    #define SI446X_CMD_POWER_UP_ARG_FUNC_SIZE 6
    #define SI446X_CMD_POWER_UP_ARG_FUNC_MASK 0x3F
    #define SI446X_CMD_POWER_UP_ARG_FUNC_MSB  5
    #define SI446X_CMD_POWER_UP_ARG_FUNC_LSB  0
    #define SI446X_CMD_POWER_UP_ARG_FUNC_INDEX 1
    #define SI446X_CMD_POWER_UP_ARG_FUNC_value (((cmd.arg.RAW[1]&0x3F)))
    #define SI446X_CMD_POWER_UP_ARG_FUNC_ENUM_BOOT 0
    #define SI446X_CMD_POWER_UP_ARG_FUNC_ENUM_MAIN 1
    #define SI446X_CMD_POWER_UP_ARG_XTAL_OPTIONS_TYPE bitfield
    #define SI446X_CMD_POWER_UP_ARG_XTAL_OPTIONS_SIZE 8
    #define SI446X_CMD_POWER_UP_ARG_XTAL_OPTIONS_MASK 0xFF
    #define SI446X_CMD_POWER_UP_ARG_XTAL_OPTIONS_MSB  7
    #define SI446X_CMD_POWER_UP_ARG_XTAL_OPTIONS_LSB  0
    #define SI446X_CMD_POWER_UP_ARG_XTAL_OPTIONS_INDEX 2
    #define SI446X_CMD_POWER_UP_ARG_XTAL_OPTIONS_value (((cmd.arg.RAW[2])))
    #define SI446X_CMD_POWER_UP_ARG_TCXO_TYPE bitfield
    #define SI446X_CMD_POWER_UP_ARG_TCXO_SIZE 1
    #define SI446X_CMD_POWER_UP_ARG_TCXO_MASK 0x01
    #define SI446X_CMD_POWER_UP_ARG_TCXO_BIT  0x01
    #define SI446X_CMD_POWER_UP_ARG_TCXO_MSB  0
    #define SI446X_CMD_POWER_UP_ARG_TCXO_LSB  0
    #define SI446X_CMD_POWER_UP_ARG_TCXO_INDEX 2
    #define SI446X_CMD_POWER_UP_ARG_TCXO_is_true (cmd.arg.RAW[2]&0x1)
    #define SI446X_CMD_POWER_UP_ARG_TCXO_value (((cmd.arg.RAW[2]&0x1)))
    #define SI446X_CMD_POWER_UP_ARG_XO_FREQ_TYPE u32
    #define SI446X_CMD_POWER_UP_ARG_XO_FREQ_SIZE 32
    #define SI446X_CMD_POWER_UP_ARG_XO_FREQ_MASK 0xFFFFFFFF
    #define SI446X_CMD_POWER_UP_ARG_XO_FREQ_MSB  31
    #define SI446X_CMD_POWER_UP_ARG_XO_FREQ_LSB  0
    #define SI446X_CMD_POWER_UP_ARG_XO_FREQ_INDEX 3
    #define SI446X_CMD_POWER_UP_ARG_XO_FREQ_value (((cmd.arg.RAW_u32[0])))
    #define SI446X_CMD_POWER_UP_ARG_XO_FREQ_MIN 25000000
    #define SI446X_CMD_POWER_UP_ARG_XO_FREQ_MAX 32000000
//POWER_UP REPLY
#define SI446X_CMD_REPLY_COUNT_POWER_UP                                        0







