ld527027363/ESP8266/proj/app/si4463/si446x_defs.h
#define SI446X_CMD_ID_GET_INT_STATUS                                           0x20
//GET_INT_STATUS ARGS
#define SI446X_CMD_ARG_COUNT_GET_INT_STATUS                                    4
    #define SI446X_CMD_GET_INT_STATUS_ARG_PH_CLR_PEND_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_PH_CLR_PEND_SIZE 8
    #define SI446X_CMD_GET_INT_STATUS_ARG_PH_CLR_PEND_MASK 0xFF
    #define SI446X_CMD_GET_INT_STATUS_ARG_PH_CLR_PEND_MSB  7
    #define SI446X_CMD_GET_INT_STATUS_ARG_PH_CLR_PEND_LSB  0
    #define SI446X_CMD_GET_INT_STATUS_ARG_PH_CLR_PEND_INDEX 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_PH_CLR_PEND_value (((cmd.arg.RAW[1])))
    #define SI446X_CMD_GET_INT_STATUS_ARG_FILTER_MATCH_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_FILTER_MATCH_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_FILTER_MATCH_PEND_CLR_MASK 0x80
    #define SI446X_CMD_GET_INT_STATUS_ARG_FILTER_MATCH_PEND_CLR_BIT  0x80
    #define SI446X_CMD_GET_INT_STATUS_ARG_FILTER_MATCH_PEND_CLR_MSB  7
    #define SI446X_CMD_GET_INT_STATUS_ARG_FILTER_MATCH_PEND_CLR_LSB  7
    #define SI446X_CMD_GET_INT_STATUS_ARG_FILTER_MATCH_PEND_CLR_INDEX 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_FILTER_MATCH_PEND_CLR_is_true (cmd.arg.RAW[1]&0x80)
    #define SI446X_CMD_GET_INT_STATUS_ARG_FILTER_MATCH_PEND_CLR_value (((cmd.arg.RAW[1]&0x80))>>7)
    #define SI446X_CMD_GET_INT_STATUS_ARG_FILTER_MISS_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_FILTER_MISS_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_FILTER_MISS_PEND_CLR_MASK 0x40
    #define SI446X_CMD_GET_INT_STATUS_ARG_FILTER_MISS_PEND_CLR_BIT  0x40
    #define SI446X_CMD_GET_INT_STATUS_ARG_FILTER_MISS_PEND_CLR_MSB  6
    #define SI446X_CMD_GET_INT_STATUS_ARG_FILTER_MISS_PEND_CLR_LSB  6
    #define SI446X_CMD_GET_INT_STATUS_ARG_FILTER_MISS_PEND_CLR_INDEX 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_FILTER_MISS_PEND_CLR_is_true (cmd.arg.RAW[1]&0x40)
    #define SI446X_CMD_GET_INT_STATUS_ARG_FILTER_MISS_PEND_CLR_value (((cmd.arg.RAW[1]&0x40))>>6)
    #define SI446X_CMD_GET_INT_STATUS_ARG_PACKET_SENT_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_PACKET_SENT_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_PACKET_SENT_PEND_CLR_MASK 0x20
    #define SI446X_CMD_GET_INT_STATUS_ARG_PACKET_SENT_PEND_CLR_BIT  0x20
    #define SI446X_CMD_GET_INT_STATUS_ARG_PACKET_SENT_PEND_CLR_MSB  5
    #define SI446X_CMD_GET_INT_STATUS_ARG_PACKET_SENT_PEND_CLR_LSB  5
    #define SI446X_CMD_GET_INT_STATUS_ARG_PACKET_SENT_PEND_CLR_INDEX 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_PACKET_SENT_PEND_CLR_is_true (cmd.arg.RAW[1]&0x20)
    #define SI446X_CMD_GET_INT_STATUS_ARG_PACKET_SENT_PEND_CLR_value (((cmd.arg.RAW[1]&0x20))>>5)
    #define SI446X_CMD_GET_INT_STATUS_ARG_PACKET_RX_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_PACKET_RX_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_PACKET_RX_PEND_CLR_MASK 0x10
    #define SI446X_CMD_GET_INT_STATUS_ARG_PACKET_RX_PEND_CLR_BIT  0x10
    #define SI446X_CMD_GET_INT_STATUS_ARG_PACKET_RX_PEND_CLR_MSB  4
    #define SI446X_CMD_GET_INT_STATUS_ARG_PACKET_RX_PEND_CLR_LSB  4
    #define SI446X_CMD_GET_INT_STATUS_ARG_PACKET_RX_PEND_CLR_INDEX 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_PACKET_RX_PEND_CLR_is_true (cmd.arg.RAW[1]&0x10)
    #define SI446X_CMD_GET_INT_STATUS_ARG_PACKET_RX_PEND_CLR_value (((cmd.arg.RAW[1]&0x10))>>4)
    #define SI446X_CMD_GET_INT_STATUS_ARG_CRC_ERROR_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_CRC_ERROR_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_CRC_ERROR_PEND_CLR_MASK 0x08
    #define SI446X_CMD_GET_INT_STATUS_ARG_CRC_ERROR_PEND_CLR_BIT  0x08
    #define SI446X_CMD_GET_INT_STATUS_ARG_CRC_ERROR_PEND_CLR_MSB  3
    #define SI446X_CMD_GET_INT_STATUS_ARG_CRC_ERROR_PEND_CLR_LSB  3
    #define SI446X_CMD_GET_INT_STATUS_ARG_CRC_ERROR_PEND_CLR_INDEX 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_CRC_ERROR_PEND_CLR_is_true (cmd.arg.RAW[1]&0x8)
    #define SI446X_CMD_GET_INT_STATUS_ARG_CRC_ERROR_PEND_CLR_value (((cmd.arg.RAW[1]&0x8))>>3)
    #define SI446X_CMD_GET_INT_STATUS_ARG_TX_FIFO_ALMOST_EMPTY_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_TX_FIFO_ALMOST_EMPTY_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_TX_FIFO_ALMOST_EMPTY_PEND_CLR_MASK 0x02
    #define SI446X_CMD_GET_INT_STATUS_ARG_TX_FIFO_ALMOST_EMPTY_PEND_CLR_BIT  0x02
    #define SI446X_CMD_GET_INT_STATUS_ARG_TX_FIFO_ALMOST_EMPTY_PEND_CLR_MSB  1
    #define SI446X_CMD_GET_INT_STATUS_ARG_TX_FIFO_ALMOST_EMPTY_PEND_CLR_LSB  1
    #define SI446X_CMD_GET_INT_STATUS_ARG_TX_FIFO_ALMOST_EMPTY_PEND_CLR_INDEX 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_TX_FIFO_ALMOST_EMPTY_PEND_CLR_is_true (cmd.arg.RAW[1]&0x2)
    #define SI446X_CMD_GET_INT_STATUS_ARG_TX_FIFO_ALMOST_EMPTY_PEND_CLR_value (((cmd.arg.RAW[1]&0x2))>>1)
    #define SI446X_CMD_GET_INT_STATUS_ARG_RX_FIFO_ALMOST_FULL_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_RX_FIFO_ALMOST_FULL_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_RX_FIFO_ALMOST_FULL_PEND_CLR_MASK 0x01
    #define SI446X_CMD_GET_INT_STATUS_ARG_RX_FIFO_ALMOST_FULL_PEND_CLR_BIT  0x01
    #define SI446X_CMD_GET_INT_STATUS_ARG_RX_FIFO_ALMOST_FULL_PEND_CLR_MSB  0
    #define SI446X_CMD_GET_INT_STATUS_ARG_RX_FIFO_ALMOST_FULL_PEND_CLR_LSB  0
    #define SI446X_CMD_GET_INT_STATUS_ARG_RX_FIFO_ALMOST_FULL_PEND_CLR_INDEX 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_RX_FIFO_ALMOST_FULL_PEND_CLR_is_true (cmd.arg.RAW[1]&0x1)
    #define SI446X_CMD_GET_INT_STATUS_ARG_RX_FIFO_ALMOST_FULL_PEND_CLR_value (((cmd.arg.RAW[1]&0x1)))
    #define SI446X_CMD_GET_INT_STATUS_ARG_MODEM_CLR_PEND_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_MODEM_CLR_PEND_SIZE 8
    #define SI446X_CMD_GET_INT_STATUS_ARG_MODEM_CLR_PEND_MASK 0xFF
    #define SI446X_CMD_GET_INT_STATUS_ARG_MODEM_CLR_PEND_MSB  7
    #define SI446X_CMD_GET_INT_STATUS_ARG_MODEM_CLR_PEND_LSB  0
    #define SI446X_CMD_GET_INT_STATUS_ARG_MODEM_CLR_PEND_INDEX 2
    #define SI446X_CMD_GET_INT_STATUS_ARG_MODEM_CLR_PEND_value (((cmd.arg.RAW[2])))
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_LATCH_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_LATCH_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_LATCH_PEND_CLR_MASK 0x80
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_LATCH_PEND_CLR_BIT  0x80
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_LATCH_PEND_CLR_MSB  7
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_LATCH_PEND_CLR_LSB  7
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_LATCH_PEND_CLR_INDEX 2
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_LATCH_PEND_CLR_is_true (cmd.arg.RAW[2]&0x80)
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_LATCH_PEND_CLR_value (((cmd.arg.RAW[2]&0x80))>>7)
    #define SI446X_CMD_GET_INT_STATUS_ARG_POSTAMBLE_DETECT_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_POSTAMBLE_DETECT_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_POSTAMBLE_DETECT_PEND_CLR_MASK 0x40
    #define SI446X_CMD_GET_INT_STATUS_ARG_POSTAMBLE_DETECT_PEND_CLR_BIT  0x40
    #define SI446X_CMD_GET_INT_STATUS_ARG_POSTAMBLE_DETECT_PEND_CLR_MSB  6
    #define SI446X_CMD_GET_INT_STATUS_ARG_POSTAMBLE_DETECT_PEND_CLR_LSB  6
    #define SI446X_CMD_GET_INT_STATUS_ARG_POSTAMBLE_DETECT_PEND_CLR_INDEX 2
    #define SI446X_CMD_GET_INT_STATUS_ARG_POSTAMBLE_DETECT_PEND_CLR_is_true (cmd.arg.RAW[2]&0x40)
    #define SI446X_CMD_GET_INT_STATUS_ARG_POSTAMBLE_DETECT_PEND_CLR_value (((cmd.arg.RAW[2]&0x40))>>6)
    #define SI446X_CMD_GET_INT_STATUS_ARG_INVALID_SYNC_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_INVALID_SYNC_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_INVALID_SYNC_PEND_CLR_MASK 0x20
    #define SI446X_CMD_GET_INT_STATUS_ARG_INVALID_SYNC_PEND_CLR_BIT  0x20
    #define SI446X_CMD_GET_INT_STATUS_ARG_INVALID_SYNC_PEND_CLR_MSB  5
    #define SI446X_CMD_GET_INT_STATUS_ARG_INVALID_SYNC_PEND_CLR_LSB  5
    #define SI446X_CMD_GET_INT_STATUS_ARG_INVALID_SYNC_PEND_CLR_INDEX 2
    #define SI446X_CMD_GET_INT_STATUS_ARG_INVALID_SYNC_PEND_CLR_is_true (cmd.arg.RAW[2]&0x20)
    #define SI446X_CMD_GET_INT_STATUS_ARG_INVALID_SYNC_PEND_CLR_value (((cmd.arg.RAW[2]&0x20))>>5)
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_JUMP_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_JUMP_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_JUMP_PEND_CLR_MASK 0x10
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_JUMP_PEND_CLR_BIT  0x10
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_JUMP_PEND_CLR_MSB  4
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_JUMP_PEND_CLR_LSB  4
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_JUMP_PEND_CLR_INDEX 2
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_JUMP_PEND_CLR_is_true (cmd.arg.RAW[2]&0x10)
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_JUMP_PEND_CLR_value (((cmd.arg.RAW[2]&0x10))>>4)
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_PEND_CLR_MASK 0x08
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_PEND_CLR_BIT  0x08
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_PEND_CLR_MSB  3
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_PEND_CLR_LSB  3
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_PEND_CLR_INDEX 2
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_PEND_CLR_is_true (cmd.arg.RAW[2]&0x8)
    #define SI446X_CMD_GET_INT_STATUS_ARG_RSSI_PEND_CLR_value (((cmd.arg.RAW[2]&0x8))>>3)
    #define SI446X_CMD_GET_INT_STATUS_ARG_INVALID_PREAMBLE_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_INVALID_PREAMBLE_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_INVALID_PREAMBLE_PEND_CLR_MASK 0x04
    #define SI446X_CMD_GET_INT_STATUS_ARG_INVALID_PREAMBLE_PEND_CLR_BIT  0x04
    #define SI446X_CMD_GET_INT_STATUS_ARG_INVALID_PREAMBLE_PEND_CLR_MSB  2
    #define SI446X_CMD_GET_INT_STATUS_ARG_INVALID_PREAMBLE_PEND_CLR_LSB  2
    #define SI446X_CMD_GET_INT_STATUS_ARG_INVALID_PREAMBLE_PEND_CLR_INDEX 2
    #define SI446X_CMD_GET_INT_STATUS_ARG_INVALID_PREAMBLE_PEND_CLR_is_true (cmd.arg.RAW[2]&0x4)
    #define SI446X_CMD_GET_INT_STATUS_ARG_INVALID_PREAMBLE_PEND_CLR_value (((cmd.arg.RAW[2]&0x4))>>2)
    #define SI446X_CMD_GET_INT_STATUS_ARG_PREAMBLE_DETECT_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_PREAMBLE_DETECT_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_PREAMBLE_DETECT_PEND_CLR_MASK 0x02
    #define SI446X_CMD_GET_INT_STATUS_ARG_PREAMBLE_DETECT_PEND_CLR_BIT  0x02
    #define SI446X_CMD_GET_INT_STATUS_ARG_PREAMBLE_DETECT_PEND_CLR_MSB  1
    #define SI446X_CMD_GET_INT_STATUS_ARG_PREAMBLE_DETECT_PEND_CLR_LSB  1
    #define SI446X_CMD_GET_INT_STATUS_ARG_PREAMBLE_DETECT_PEND_CLR_INDEX 2
    #define SI446X_CMD_GET_INT_STATUS_ARG_PREAMBLE_DETECT_PEND_CLR_is_true (cmd.arg.RAW[2]&0x2)
    #define SI446X_CMD_GET_INT_STATUS_ARG_PREAMBLE_DETECT_PEND_CLR_value (((cmd.arg.RAW[2]&0x2))>>1)
    #define SI446X_CMD_GET_INT_STATUS_ARG_SYNC_DETECT_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_SYNC_DETECT_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_SYNC_DETECT_PEND_CLR_MASK 0x01
    #define SI446X_CMD_GET_INT_STATUS_ARG_SYNC_DETECT_PEND_CLR_BIT  0x01
    #define SI446X_CMD_GET_INT_STATUS_ARG_SYNC_DETECT_PEND_CLR_MSB  0
    #define SI446X_CMD_GET_INT_STATUS_ARG_SYNC_DETECT_PEND_CLR_LSB  0
    #define SI446X_CMD_GET_INT_STATUS_ARG_SYNC_DETECT_PEND_CLR_INDEX 2
    #define SI446X_CMD_GET_INT_STATUS_ARG_SYNC_DETECT_PEND_CLR_is_true (cmd.arg.RAW[2]&0x1)
    #define SI446X_CMD_GET_INT_STATUS_ARG_SYNC_DETECT_PEND_CLR_value (((cmd.arg.RAW[2]&0x1)))
    #define SI446X_CMD_GET_INT_STATUS_ARG_CHIP_CLR_PEND_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_CHIP_CLR_PEND_SIZE 8
    #define SI446X_CMD_GET_INT_STATUS_ARG_CHIP_CLR_PEND_MASK 0xFF
    #define SI446X_CMD_GET_INT_STATUS_ARG_CHIP_CLR_PEND_MSB  7
    #define SI446X_CMD_GET_INT_STATUS_ARG_CHIP_CLR_PEND_LSB  0
    #define SI446X_CMD_GET_INT_STATUS_ARG_CHIP_CLR_PEND_INDEX 3
    #define SI446X_CMD_GET_INT_STATUS_ARG_CHIP_CLR_PEND_value (((cmd.arg.RAW[3])))
    #define SI446X_CMD_GET_INT_STATUS_ARG_CAL_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_CAL_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_CAL_PEND_CLR_MASK 0x40
    #define SI446X_CMD_GET_INT_STATUS_ARG_CAL_PEND_CLR_BIT  0x40
    #define SI446X_CMD_GET_INT_STATUS_ARG_CAL_PEND_CLR_MSB  6
    #define SI446X_CMD_GET_INT_STATUS_ARG_CAL_PEND_CLR_LSB  6
    #define SI446X_CMD_GET_INT_STATUS_ARG_CAL_PEND_CLR_INDEX 3
    #define SI446X_CMD_GET_INT_STATUS_ARG_CAL_PEND_CLR_is_true (cmd.arg.RAW[3]&0x40)
    #define SI446X_CMD_GET_INT_STATUS_ARG_CAL_PEND_CLR_value (((cmd.arg.RAW[3]&0x40))>>6)
    #define SI446X_CMD_GET_INT_STATUS_ARG_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_CLR_MASK 0x20
    #define SI446X_CMD_GET_INT_STATUS_ARG_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_CLR_BIT  0x20
    #define SI446X_CMD_GET_INT_STATUS_ARG_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_CLR_MSB  5
    #define SI446X_CMD_GET_INT_STATUS_ARG_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_CLR_LSB  5
    #define SI446X_CMD_GET_INT_STATUS_ARG_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_CLR_INDEX 3
    #define SI446X_CMD_GET_INT_STATUS_ARG_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_CLR_is_true (cmd.arg.RAW[3]&0x20)
    #define SI446X_CMD_GET_INT_STATUS_ARG_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_CLR_value (((cmd.arg.RAW[3]&0x20))>>5)
    #define SI446X_CMD_GET_INT_STATUS_ARG_STATE_CHANGE_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_STATE_CHANGE_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_STATE_CHANGE_PEND_CLR_MASK 0x10
    #define SI446X_CMD_GET_INT_STATUS_ARG_STATE_CHANGE_PEND_CLR_BIT  0x10
    #define SI446X_CMD_GET_INT_STATUS_ARG_STATE_CHANGE_PEND_CLR_MSB  4
    #define SI446X_CMD_GET_INT_STATUS_ARG_STATE_CHANGE_PEND_CLR_LSB  4
    #define SI446X_CMD_GET_INT_STATUS_ARG_STATE_CHANGE_PEND_CLR_INDEX 3
    #define SI446X_CMD_GET_INT_STATUS_ARG_STATE_CHANGE_PEND_CLR_is_true (cmd.arg.RAW[3]&0x10)
    #define SI446X_CMD_GET_INT_STATUS_ARG_STATE_CHANGE_PEND_CLR_value (((cmd.arg.RAW[3]&0x10))>>4)
    #define SI446X_CMD_GET_INT_STATUS_ARG_CMD_ERROR_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_CMD_ERROR_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_CMD_ERROR_PEND_CLR_MASK 0x08
    #define SI446X_CMD_GET_INT_STATUS_ARG_CMD_ERROR_PEND_CLR_BIT  0x08
    #define SI446X_CMD_GET_INT_STATUS_ARG_CMD_ERROR_PEND_CLR_MSB  3
    #define SI446X_CMD_GET_INT_STATUS_ARG_CMD_ERROR_PEND_CLR_LSB  3
    #define SI446X_CMD_GET_INT_STATUS_ARG_CMD_ERROR_PEND_CLR_INDEX 3
    #define SI446X_CMD_GET_INT_STATUS_ARG_CMD_ERROR_PEND_CLR_is_true (cmd.arg.RAW[3]&0x8)
    #define SI446X_CMD_GET_INT_STATUS_ARG_CMD_ERROR_PEND_CLR_value (((cmd.arg.RAW[3]&0x8))>>3)
    #define SI446X_CMD_GET_INT_STATUS_ARG_CHIP_READY_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_CHIP_READY_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_CHIP_READY_PEND_CLR_MASK 0x04
    #define SI446X_CMD_GET_INT_STATUS_ARG_CHIP_READY_PEND_CLR_BIT  0x04
    #define SI446X_CMD_GET_INT_STATUS_ARG_CHIP_READY_PEND_CLR_MSB  2
    #define SI446X_CMD_GET_INT_STATUS_ARG_CHIP_READY_PEND_CLR_LSB  2
    #define SI446X_CMD_GET_INT_STATUS_ARG_CHIP_READY_PEND_CLR_INDEX 3
    #define SI446X_CMD_GET_INT_STATUS_ARG_CHIP_READY_PEND_CLR_is_true (cmd.arg.RAW[3]&0x4)
    #define SI446X_CMD_GET_INT_STATUS_ARG_CHIP_READY_PEND_CLR_value (((cmd.arg.RAW[3]&0x4))>>2)
    #define SI446X_CMD_GET_INT_STATUS_ARG_LOW_BATT_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_LOW_BATT_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_LOW_BATT_PEND_CLR_MASK 0x02
    #define SI446X_CMD_GET_INT_STATUS_ARG_LOW_BATT_PEND_CLR_BIT  0x02
    #define SI446X_CMD_GET_INT_STATUS_ARG_LOW_BATT_PEND_CLR_MSB  1
    #define SI446X_CMD_GET_INT_STATUS_ARG_LOW_BATT_PEND_CLR_LSB  1
    #define SI446X_CMD_GET_INT_STATUS_ARG_LOW_BATT_PEND_CLR_INDEX 3
    #define SI446X_CMD_GET_INT_STATUS_ARG_LOW_BATT_PEND_CLR_is_true (cmd.arg.RAW[3]&0x2)
    #define SI446X_CMD_GET_INT_STATUS_ARG_LOW_BATT_PEND_CLR_value (((cmd.arg.RAW[3]&0x2))>>1)
    #define SI446X_CMD_GET_INT_STATUS_ARG_WUT_PEND_CLR_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_ARG_WUT_PEND_CLR_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_ARG_WUT_PEND_CLR_MASK 0x01
    #define SI446X_CMD_GET_INT_STATUS_ARG_WUT_PEND_CLR_BIT  0x01
    #define SI446X_CMD_GET_INT_STATUS_ARG_WUT_PEND_CLR_MSB  0
    #define SI446X_CMD_GET_INT_STATUS_ARG_WUT_PEND_CLR_LSB  0
    #define SI446X_CMD_GET_INT_STATUS_ARG_WUT_PEND_CLR_INDEX 3
    #define SI446X_CMD_GET_INT_STATUS_ARG_WUT_PEND_CLR_is_true (cmd.arg.RAW[3]&0x1)
    #define SI446X_CMD_GET_INT_STATUS_ARG_WUT_PEND_CLR_value (((cmd.arg.RAW[3]&0x1)))
//GET_INT_STATUS REPLY
#define SI446X_CMD_REPLY_COUNT_GET_INT_STATUS                                  8
    #define SI446X_CMD_GET_INT_STATUS_REP_INT_PEND_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_REP_INT_PEND_SIZE 8
    #define SI446X_CMD_GET_INT_STATUS_REP_INT_PEND_MASK 0xFF
    #define SI446X_CMD_GET_INT_STATUS_REP_INT_PEND_MSB  7
    #define SI446X_CMD_GET_INT_STATUS_REP_INT_PEND_LSB  0
    #define SI446X_CMD_GET_INT_STATUS_REP_INT_PEND_INDEX 1
    #define SI446X_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_PEND_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_PEND_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_PEND_MASK 0x04
    #define SI446X_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_PEND_BIT  0x04
    #define SI446X_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_PEND_MSB  2
    #define SI446X_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_PEND_LSB  2
    #define SI446X_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_PEND_INDEX 1
    #define SI446X_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_PEND_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_PEND_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_PEND_MASK 0x02
    #define SI446X_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_PEND_BIT  0x02
    #define SI446X_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_PEND_MSB  1
    #define SI446X_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_PEND_LSB  1
    #define SI446X_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_PEND_INDEX 1
    #define SI446X_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_PEND_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_PEND_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_PEND_MASK 0x01
    #define SI446X_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_PEND_BIT  0x01
    #define SI446X_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_PEND_MSB  0
    #define SI446X_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_PEND_LSB  0
    #define SI446X_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_PEND_INDEX 1
    #define SI446X_CMD_GET_INT_STATUS_REP_INT_STATUS_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_REP_INT_STATUS_SIZE 8
    #define SI446X_CMD_GET_INT_STATUS_REP_INT_STATUS_MASK 0xFF
    #define SI446X_CMD_GET_INT_STATUS_REP_INT_STATUS_MSB  7
    #define SI446X_CMD_GET_INT_STATUS_REP_INT_STATUS_LSB  0
    #define SI446X_CMD_GET_INT_STATUS_REP_INT_STATUS_INDEX 2
    #define SI446X_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_MASK 0x04
    #define SI446X_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_BIT  0x04
    #define SI446X_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_MSB  2
    #define SI446X_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_LSB  2
    #define SI446X_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_INDEX 2
    #define SI446X_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_MASK 0x02
    #define SI446X_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_BIT  0x02
    #define SI446X_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_MSB  1
    #define SI446X_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_LSB  1
    #define SI446X_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_INDEX 2
    #define SI446X_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_MASK 0x01
    #define SI446X_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_BIT  0x01
    #define SI446X_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_MSB  0
    #define SI446X_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_LSB  0
    #define SI446X_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_INDEX 2
    #define SI446X_CMD_GET_INT_STATUS_REP_PH_PEND_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_REP_PH_PEND_SIZE 8
    #define SI446X_CMD_GET_INT_STATUS_REP_PH_PEND_MASK 0xFF
    #define SI446X_CMD_GET_INT_STATUS_REP_PH_PEND_MSB  7
    #define SI446X_CMD_GET_INT_STATUS_REP_PH_PEND_LSB  0
    #define SI446X_CMD_GET_INT_STATUS_REP_PH_PEND_INDEX 3
    #define SI446X_CMD_GET_INT_STATUS_REP_FILTER_MATCH_PEND_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_REP_FILTER_MATCH_PEND_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_REP_FILTER_MATCH_PEND_MASK 0x80
    #define SI446X_CMD_GET_INT_STATUS_REP_FILTER_MATCH_PEND_BIT  0x80
    #define SI446X_CMD_GET_INT_STATUS_REP_FILTER_MATCH_PEND_MSB  7
    #define SI446X_CMD_GET_INT_STATUS_REP_FILTER_MATCH_PEND_LSB  7
    #define SI446X_CMD_GET_INT_STATUS_REP_FILTER_MATCH_PEND_INDEX 3
    #define SI446X_CMD_GET_INT_STATUS_REP_FILTER_MISS_PEND_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_REP_FILTER_MISS_PEND_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_REP_FILTER_MISS_PEND_MASK 0x40
    #define SI446X_CMD_GET_INT_STATUS_REP_FILTER_MISS_PEND_BIT  0x40
    #define SI446X_CMD_GET_INT_STATUS_REP_FILTER_MISS_PEND_MSB  6
    #define SI446X_CMD_GET_INT_STATUS_REP_FILTER_MISS_PEND_LSB  6
    #define SI446X_CMD_GET_INT_STATUS_REP_FILTER_MISS_PEND_INDEX 3
    #define SI446X_CMD_GET_INT_STATUS_REP_PACKET_SENT_PEND_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_REP_PACKET_SENT_PEND_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_REP_PACKET_SENT_PEND_MASK 0x20
    #define SI446X_CMD_GET_INT_STATUS_REP_PACKET_SENT_PEND_BIT  0x20
    #define SI446X_CMD_GET_INT_STATUS_REP_PACKET_SENT_PEND_MSB  5
    #define SI446X_CMD_GET_INT_STATUS_REP_PACKET_SENT_PEND_LSB  5
    #define SI446X_CMD_GET_INT_STATUS_REP_PACKET_SENT_PEND_INDEX 3
    #define SI446X_CMD_GET_INT_STATUS_REP_PACKET_RX_PEND_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_REP_PACKET_RX_PEND_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_REP_PACKET_RX_PEND_MASK 0x10
    #define SI446X_CMD_GET_INT_STATUS_REP_PACKET_RX_PEND_BIT  0x10
    #define SI446X_CMD_GET_INT_STATUS_REP_PACKET_RX_PEND_MSB  4
    #define SI446X_CMD_GET_INT_STATUS_REP_PACKET_RX_PEND_LSB  4
    #define SI446X_CMD_GET_INT_STATUS_REP_PACKET_RX_PEND_INDEX 3
    #define SI446X_CMD_GET_INT_STATUS_REP_CRC_ERROR_PEND_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_REP_CRC_ERROR_PEND_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_REP_CRC_ERROR_PEND_MASK 0x08
    #define SI446X_CMD_GET_INT_STATUS_REP_CRC_ERROR_PEND_BIT  0x08
    #define SI446X_CMD_GET_INT_STATUS_REP_CRC_ERROR_PEND_MSB  3
    #define SI446X_CMD_GET_INT_STATUS_REP_CRC_ERROR_PEND_LSB  3
    #define SI446X_CMD_GET_INT_STATUS_REP_CRC_ERROR_PEND_INDEX 3
    #define SI446X_CMD_GET_INT_STATUS_REP_TX_FIFO_ALMOST_EMPTY_PEND_TYPE bitfield
    #define SI446X_CMD_GET_INT_STATUS_REP_TX_FIFO_ALMOST_EMPTY_PEND_SIZE 1
    #define SI446X_CMD_GET_INT_STATUS_REP_TX_FIFO_ALMOST_EMPTY_PEND_MASK 0x02
    #define SI446X_CMD_GET_INT_STATUS_REP_TX_FIFO_ALMOST_EMPTY_PEND_BIT  0x02
    #define SI446X_CMD_GET_INT_STATUS_REP_TX_FIFO_ALMOST_EMPTY_PEND_MSB  1
    #define SI446X_CMD_GET_INT_STATUS_REP_TX_FIFO_ALMOST_EMPTY_PEND_LSB  1
    #define SI446X_CMD_GET_INT_STATUS_REP_TX_FIFO_ALMOST_EMPTY_PEND_INDEX 3
