ld527027363/ESP8266/proj/app/si4463/si446x_defs.h
#define SI446X_CMD_ID_GET_PH_STATUS                                            0x21
//GET_PH_STATUS ARGS
#define SI446X_CMD_ARG_COUNT_GET_PH_STATUS                                     1
//GET_PH_STATUS REPLY
#define SI446X_CMD_REPLY_COUNT_GET_PH_STATUS                                   2
    #define SI446X_CMD_GET_PH_STATUS_REP_PH_PEND_TYPE bitfield
    #define SI446X_CMD_GET_PH_STATUS_REP_PH_PEND_SIZE 8
    #define SI446X_CMD_GET_PH_STATUS_REP_PH_PEND_MASK 0xFF
    #define SI446X_CMD_GET_PH_STATUS_REP_PH_PEND_MSB  7
    #define SI446X_CMD_GET_PH_STATUS_REP_PH_PEND_LSB  0
    #define SI446X_CMD_GET_PH_STATUS_REP_PH_PEND_INDEX 1
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MATCH_PEND_TYPE bitfield
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MATCH_PEND_SIZE 1
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MATCH_PEND_MASK 0x80
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MATCH_PEND_BIT  0x80
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MATCH_PEND_MSB  7
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MATCH_PEND_LSB  7
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MATCH_PEND_INDEX 1
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MISS_PEND_TYPE bitfield
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MISS_PEND_SIZE 1
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MISS_PEND_MASK 0x40
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MISS_PEND_BIT  0x40
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MISS_PEND_MSB  6
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MISS_PEND_LSB  6
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MISS_PEND_INDEX 1
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_SENT_PEND_TYPE bitfield
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_SENT_PEND_SIZE 1
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_SENT_PEND_MASK 0x20
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_SENT_PEND_BIT  0x20
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_SENT_PEND_MSB  5
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_SENT_PEND_LSB  5
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_SENT_PEND_INDEX 1
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_RX_PEND_TYPE bitfield
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_RX_PEND_SIZE 1
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_RX_PEND_MASK 0x10
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_RX_PEND_BIT  0x10
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_RX_PEND_MSB  4
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_RX_PEND_LSB  4
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_RX_PEND_INDEX 1
    #define SI446X_CMD_GET_PH_STATUS_REP_CRC_ERROR_PEND_TYPE bitfield
    #define SI446X_CMD_GET_PH_STATUS_REP_CRC_ERROR_PEND_SIZE 1
    #define SI446X_CMD_GET_PH_STATUS_REP_CRC_ERROR_PEND_MASK 0x08
    #define SI446X_CMD_GET_PH_STATUS_REP_CRC_ERROR_PEND_BIT  0x08
    #define SI446X_CMD_GET_PH_STATUS_REP_CRC_ERROR_PEND_MSB  3
    #define SI446X_CMD_GET_PH_STATUS_REP_CRC_ERROR_PEND_LSB  3
    #define SI446X_CMD_GET_PH_STATUS_REP_CRC_ERROR_PEND_INDEX 1
    #define SI446X_CMD_GET_PH_STATUS_REP_TX_FIFO_ALMOST_EMPTY_PEND_TYPE bitfield
    #define SI446X_CMD_GET_PH_STATUS_REP_TX_FIFO_ALMOST_EMPTY_PEND_SIZE 1
    #define SI446X_CMD_GET_PH_STATUS_REP_TX_FIFO_ALMOST_EMPTY_PEND_MASK 0x02
    #define SI446X_CMD_GET_PH_STATUS_REP_TX_FIFO_ALMOST_EMPTY_PEND_BIT  0x02
    #define SI446X_CMD_GET_PH_STATUS_REP_TX_FIFO_ALMOST_EMPTY_PEND_MSB  1
    #define SI446X_CMD_GET_PH_STATUS_REP_TX_FIFO_ALMOST_EMPTY_PEND_LSB  1
    #define SI446X_CMD_GET_PH_STATUS_REP_TX_FIFO_ALMOST_EMPTY_PEND_INDEX 1
    #define SI446X_CMD_GET_PH_STATUS_REP_RX_FIFO_ALMOST_FULL_PEND_TYPE bitfield
    #define SI446X_CMD_GET_PH_STATUS_REP_RX_FIFO_ALMOST_FULL_PEND_SIZE 1
    #define SI446X_CMD_GET_PH_STATUS_REP_RX_FIFO_ALMOST_FULL_PEND_MASK 0x01
    #define SI446X_CMD_GET_PH_STATUS_REP_RX_FIFO_ALMOST_FULL_PEND_BIT  0x01
    #define SI446X_CMD_GET_PH_STATUS_REP_RX_FIFO_ALMOST_FULL_PEND_MSB  0
    #define SI446X_CMD_GET_PH_STATUS_REP_RX_FIFO_ALMOST_FULL_PEND_LSB  0
    #define SI446X_CMD_GET_PH_STATUS_REP_RX_FIFO_ALMOST_FULL_PEND_INDEX 1
    #define SI446X_CMD_GET_PH_STATUS_REP_PH_STATUS_TYPE bitfield
    #define SI446X_CMD_GET_PH_STATUS_REP_PH_STATUS_SIZE 8
    #define SI446X_CMD_GET_PH_STATUS_REP_PH_STATUS_MASK 0xFF
    #define SI446X_CMD_GET_PH_STATUS_REP_PH_STATUS_MSB  7
    #define SI446X_CMD_GET_PH_STATUS_REP_PH_STATUS_LSB  0
    #define SI446X_CMD_GET_PH_STATUS_REP_PH_STATUS_INDEX 2
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MATCH_TYPE bitfield
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MATCH_SIZE 1
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MATCH_MASK 0x80
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MATCH_BIT  0x80
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MATCH_MSB  7
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MATCH_LSB  7
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MATCH_INDEX 2
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MISS_TYPE bitfield
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MISS_SIZE 1
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MISS_MASK 0x40
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MISS_BIT  0x40
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MISS_MSB  6
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MISS_LSB  6
    #define SI446X_CMD_GET_PH_STATUS_REP_FILTER_MISS_INDEX 2
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_SENT_TYPE bitfield
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_SENT_SIZE 1
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_SENT_MASK 0x20
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_SENT_BIT  0x20
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_SENT_MSB  5
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_SENT_LSB  5
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_SENT_INDEX 2
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_RX_TYPE bitfield
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_RX_SIZE 1
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_RX_MASK 0x10
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_RX_BIT  0x10
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_RX_MSB  4
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_RX_LSB  4
    #define SI446X_CMD_GET_PH_STATUS_REP_PACKET_RX_INDEX 2
    #define SI446X_CMD_GET_PH_STATUS_REP_CRC_ERROR_TYPE bitfield
    #define SI446X_CMD_GET_PH_STATUS_REP_CRC_ERROR_SIZE 1
    #define SI446X_CMD_GET_PH_STATUS_REP_CRC_ERROR_MASK 0x08
    #define SI446X_CMD_GET_PH_STATUS_REP_CRC_ERROR_BIT  0x08
    #define SI446X_CMD_GET_PH_STATUS_REP_CRC_ERROR_MSB  3
    #define SI446X_CMD_GET_PH_STATUS_REP_CRC_ERROR_LSB  3
    #define SI446X_CMD_GET_PH_STATUS_REP_CRC_ERROR_INDEX 2
    #define SI446X_CMD_GET_PH_STATUS_REP_TX_FIFO_ALMOST_EMPTY_TYPE bitfield
    #define SI446X_CMD_GET_PH_STATUS_REP_TX_FIFO_ALMOST_EMPTY_SIZE 1
    #define SI446X_CMD_GET_PH_STATUS_REP_TX_FIFO_ALMOST_EMPTY_MASK 0x02
    #define SI446X_CMD_GET_PH_STATUS_REP_TX_FIFO_ALMOST_EMPTY_BIT  0x02
    #define SI446X_CMD_GET_PH_STATUS_REP_TX_FIFO_ALMOST_EMPTY_MSB  1
    #define SI446X_CMD_GET_PH_STATUS_REP_TX_FIFO_ALMOST_EMPTY_LSB  1
    #define SI446X_CMD_GET_PH_STATUS_REP_TX_FIFO_ALMOST_EMPTY_INDEX 2
    #define SI446X_CMD_GET_PH_STATUS_REP_RX_FIFO_ALMOST_FULL_TYPE bitfield
    #define SI446X_CMD_GET_PH_STATUS_REP_RX_FIFO_ALMOST_FULL_SIZE 1
    #define SI446X_CMD_GET_PH_STATUS_REP_RX_FIFO_ALMOST_FULL_MASK 0x01
    #define SI446X_CMD_GET_PH_STATUS_REP_RX_FIFO_ALMOST_FULL_BIT  0x01
    #define SI446X_CMD_GET_PH_STATUS_REP_RX_FIFO_ALMOST_FULL_MSB  0
    #define SI446X_CMD_GET_PH_STATUS_REP_RX_FIFO_ALMOST_FULL_LSB  0
    #define SI446X_CMD_GET_PH_STATUS_REP_RX_FIFO_ALMOST_FULL_INDEX 2

#define SI446X_CMD_ID_GET_MODEM_STATUS                                         0x22
//GET_MODEM_STATUS ARGS
#define SI446X_CMD_ARG_COUNT_GET_MODEM_STATUS                                  1
//GET_MODEM_STATUS REPLY
#define SI446X_CMD_REPLY_COUNT_GET_MODEM_STATUS                                8
    #define SI446X_CMD_GET_MODEM_STATUS_REP_MODEM_PEND_TYPE bitfield
    #define SI446X_CMD_GET_MODEM_STATUS_REP_MODEM_PEND_SIZE 8
    #define SI446X_CMD_GET_MODEM_STATUS_REP_MODEM_PEND_MASK 0xFF
    #define SI446X_CMD_GET_MODEM_STATUS_REP_MODEM_PEND_MSB  7
    #define SI446X_CMD_GET_MODEM_STATUS_REP_MODEM_PEND_LSB  0
    #define SI446X_CMD_GET_MODEM_STATUS_REP_MODEM_PEND_INDEX 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_LATCH_PEND_TYPE bitfield
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_LATCH_PEND_SIZE 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_LATCH_PEND_MASK 0x80
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_LATCH_PEND_BIT  0x80
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_LATCH_PEND_MSB  7
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_LATCH_PEND_LSB  7
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_LATCH_PEND_INDEX 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_POSTAMBLE_DETECT_PEND_TYPE bitfield
    #define SI446X_CMD_GET_MODEM_STATUS_REP_POSTAMBLE_DETECT_PEND_SIZE 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_POSTAMBLE_DETECT_PEND_MASK 0x40
    #define SI446X_CMD_GET_MODEM_STATUS_REP_POSTAMBLE_DETECT_PEND_BIT  0x40
    #define SI446X_CMD_GET_MODEM_STATUS_REP_POSTAMBLE_DETECT_PEND_MSB  6
    #define SI446X_CMD_GET_MODEM_STATUS_REP_POSTAMBLE_DETECT_PEND_LSB  6
    #define SI446X_CMD_GET_MODEM_STATUS_REP_POSTAMBLE_DETECT_PEND_INDEX 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_SYNC_PEND_TYPE bitfield
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_SYNC_PEND_SIZE 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_SYNC_PEND_MASK 0x20
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_SYNC_PEND_BIT  0x20
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_SYNC_PEND_MSB  5
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_SYNC_PEND_LSB  5
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_SYNC_PEND_INDEX 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_JUMP_PEND_TYPE bitfield
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_JUMP_PEND_SIZE 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_JUMP_PEND_MASK 0x10
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_JUMP_PEND_BIT  0x10
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_JUMP_PEND_MSB  4
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_JUMP_PEND_LSB  4
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_JUMP_PEND_INDEX 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_PEND_TYPE bitfield
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_PEND_SIZE 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_PEND_MASK 0x08
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_PEND_BIT  0x08
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_PEND_MSB  3
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_PEND_LSB  3
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_PEND_INDEX 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_PREAMBLE_PEND_TYPE bitfield
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_PREAMBLE_PEND_SIZE 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_PREAMBLE_PEND_MASK 0x04
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_PREAMBLE_PEND_BIT  0x04
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_PREAMBLE_PEND_MSB  2
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_PREAMBLE_PEND_LSB  2
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_PREAMBLE_PEND_INDEX 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_PREAMBLE_DETECT_PEND_TYPE bitfield
    #define SI446X_CMD_GET_MODEM_STATUS_REP_PREAMBLE_DETECT_PEND_SIZE 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_PREAMBLE_DETECT_PEND_MASK 0x02
    #define SI446X_CMD_GET_MODEM_STATUS_REP_PREAMBLE_DETECT_PEND_BIT  0x02
    #define SI446X_CMD_GET_MODEM_STATUS_REP_PREAMBLE_DETECT_PEND_MSB  1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_PREAMBLE_DETECT_PEND_LSB  1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_PREAMBLE_DETECT_PEND_INDEX 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_SYNC_DETECT_PEND_TYPE bitfield
    #define SI446X_CMD_GET_MODEM_STATUS_REP_SYNC_DETECT_PEND_SIZE 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_SYNC_DETECT_PEND_MASK 0x01
    #define SI446X_CMD_GET_MODEM_STATUS_REP_SYNC_DETECT_PEND_BIT  0x01
    #define SI446X_CMD_GET_MODEM_STATUS_REP_SYNC_DETECT_PEND_MSB  0
    #define SI446X_CMD_GET_MODEM_STATUS_REP_SYNC_DETECT_PEND_LSB  0
    #define SI446X_CMD_GET_MODEM_STATUS_REP_SYNC_DETECT_PEND_INDEX 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_MODEM_STATUS_TYPE bitfield
    #define SI446X_CMD_GET_MODEM_STATUS_REP_MODEM_STATUS_SIZE 8
    #define SI446X_CMD_GET_MODEM_STATUS_REP_MODEM_STATUS_MASK 0xFF
    #define SI446X_CMD_GET_MODEM_STATUS_REP_MODEM_STATUS_MSB  7
    #define SI446X_CMD_GET_MODEM_STATUS_REP_MODEM_STATUS_LSB  0
    #define SI446X_CMD_GET_MODEM_STATUS_REP_MODEM_STATUS_INDEX 2
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_LATCH_TYPE bitfield
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_LATCH_SIZE 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_LATCH_MASK 0x80
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_LATCH_BIT  0x80
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_LATCH_MSB  7
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_LATCH_LSB  7
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_LATCH_INDEX 2
    #define SI446X_CMD_GET_MODEM_STATUS_REP_POSTAMBLE_DETECT_TYPE bitfield
    #define SI446X_CMD_GET_MODEM_STATUS_REP_POSTAMBLE_DETECT_SIZE 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_POSTAMBLE_DETECT_MASK 0x40
    #define SI446X_CMD_GET_MODEM_STATUS_REP_POSTAMBLE_DETECT_BIT  0x40
    #define SI446X_CMD_GET_MODEM_STATUS_REP_POSTAMBLE_DETECT_MSB  6
    #define SI446X_CMD_GET_MODEM_STATUS_REP_POSTAMBLE_DETECT_LSB  6
    #define SI446X_CMD_GET_MODEM_STATUS_REP_POSTAMBLE_DETECT_INDEX 2
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_SYNC_TYPE bitfield
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_SYNC_SIZE 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_SYNC_MASK 0x20
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_SYNC_BIT  0x20
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_SYNC_MSB  5
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_SYNC_LSB  5
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_SYNC_INDEX 2
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_JUMP_TYPE bitfield
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_JUMP_SIZE 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_JUMP_MASK 0x10
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_JUMP_BIT  0x10
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_JUMP_MSB  4
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_JUMP_LSB  4
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_JUMP_INDEX 2
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_TYPE bitfield
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_SIZE 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_MASK 0x08
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_BIT  0x08
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_MSB  3
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_LSB  3
    #define SI446X_CMD_GET_MODEM_STATUS_REP_RSSI_INDEX 2
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_PREAMBLE_TYPE bitfield
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_PREAMBLE_SIZE 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_PREAMBLE_MASK 0x04
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_PREAMBLE_BIT  0x04
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_PREAMBLE_MSB  2
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_PREAMBLE_LSB  2
    #define SI446X_CMD_GET_MODEM_STATUS_REP_INVALID_PREAMBLE_INDEX 2
    #define SI446X_CMD_GET_MODEM_STATUS_REP_PREAMBLE_DETECT_TYPE bitfield
    #define SI446X_CMD_GET_MODEM_STATUS_REP_PREAMBLE_DETECT_SIZE 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_PREAMBLE_DETECT_MASK 0x02
    #define SI446X_CMD_GET_MODEM_STATUS_REP_PREAMBLE_DETECT_BIT  0x02
    #define SI446X_CMD_GET_MODEM_STATUS_REP_PREAMBLE_DETECT_MSB  1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_PREAMBLE_DETECT_LSB  1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_PREAMBLE_DETECT_INDEX 2
    #define SI446X_CMD_GET_MODEM_STATUS_REP_SYNC_DETECT_TYPE bitfield
    #define SI446X_CMD_GET_MODEM_STATUS_REP_SYNC_DETECT_SIZE 1
    #define SI446X_CMD_GET_MODEM_STATUS_REP_SYNC_DETECT_MASK 0x01
    #define SI446X_CMD_GET_MODEM_STATUS_REP_SYNC_DETECT_BIT  0x01
    #define SI446X_CMD_GET_MODEM_STATUS_REP_SYNC_DETECT_MSB  0
    #define SI446X_CMD_GET_MODEM_STATUS_REP_SYNC_DETECT_LSB  0
    #define SI446X_CMD_GET_MODEM_STATUS_REP_SYNC_DETECT_INDEX 2
    #define SI446X_CMD_GET_MODEM_STATUS_REP_CURR_RSSI_TYPE u8
    #define SI446X_CMD_GET_MODEM_STATUS_REP_CURR_RSSI_SIZE 8
    #define SI446X_CMD_GET_MODEM_STATUS_REP_CURR_RSSI_MASK 0xFF
    #define SI446X_CMD_GET_MODEM_STATUS_REP_CURR_RSSI_MSB  7
    #define SI446X_CMD_GET_MODEM_STATUS_REP_CURR_RSSI_LSB  0
    #define SI446X_CMD_GET_MODEM_STATUS_REP_CURR_RSSI_INDEX 3
    #define SI446X_CMD_GET_MODEM_STATUS_REP_LATCH_RSSI_TYPE u8
    #define SI446X_CMD_GET_MODEM_STATUS_REP_LATCH_RSSI_SIZE 8
    #define SI446X_CMD_GET_MODEM_STATUS_REP_LATCH_RSSI_MASK 0xFF
    #define SI446X_CMD_GET_MODEM_STATUS_REP_LATCH_RSSI_MSB  7
    #define SI446X_CMD_GET_MODEM_STATUS_REP_LATCH_RSSI_LSB  0
    #define SI446X_CMD_GET_MODEM_STATUS_REP_LATCH_RSSI_INDEX 4
    #define SI446X_CMD_GET_MODEM_STATUS_REP_ANT1_RSSI_TYPE u8
    #define SI446X_CMD_GET_MODEM_STATUS_REP_ANT1_RSSI_SIZE 8
    #define SI446X_CMD_GET_MODEM_STATUS_REP_ANT1_RSSI_MASK 0xFF
    #define SI446X_CMD_GET_MODEM_STATUS_REP_ANT1_RSSI_MSB  7
    #define SI446X_CMD_GET_MODEM_STATUS_REP_ANT1_RSSI_LSB  0
    #define SI446X_CMD_GET_MODEM_STATUS_REP_ANT1_RSSI_INDEX 5
    #define SI446X_CMD_GET_MODEM_STATUS_REP_ANT2_RSSI_TYPE u8
    #define SI446X_CMD_GET_MODEM_STATUS_REP_ANT2_RSSI_SIZE 8
    #define SI446X_CMD_GET_MODEM_STATUS_REP_ANT2_RSSI_MASK 0xFF
    #define SI446X_CMD_GET_MODEM_STATUS_REP_ANT2_RSSI_MSB  7
    #define SI446X_CMD_GET_MODEM_STATUS_REP_ANT2_RSSI_LSB  0
    #define SI446X_CMD_GET_MODEM_STATUS_REP_ANT2_RSSI_INDEX 6
    #define SI446X_CMD_GET_MODEM_STATUS_REP_AFC_FREQ_OFFSET_TYPE u16
    #define SI446X_CMD_GET_MODEM_STATUS_REP_AFC_FREQ_OFFSET_SIZE 16
    #define SI446X_CMD_GET_MODEM_STATUS_REP_AFC_FREQ_OFFSET_MASK 0xFFFF
    #define SI446X_CMD_GET_MODEM_STATUS_REP_AFC_FREQ_OFFSET_MSB  15
    #define SI446X_CMD_GET_MODEM_STATUS_REP_AFC_FREQ_OFFSET_LSB  0
    #define SI446X_CMD_GET_MODEM_STATUS_REP_AFC_FREQ_OFFSET_INDEX 7

