ld527027363/ESP8266/proj/app/si4463/si446x_defs.h
#define SI446X_CMD_ID_START_MFSK                                               0x35
//START_MFSK ARGS
#define SI446X_CMD_ARG_COUNT_START_MFSK                                        4
    #define SI446X_CMD_START_MFSK_ARG_DIR_MODE_CFG_TYPE bitfield
    #define SI446X_CMD_START_MFSK_ARG_DIR_MODE_CFG_SIZE 8
    #define SI446X_CMD_START_MFSK_ARG_DIR_MODE_CFG_MASK 0xFF
    #define SI446X_CMD_START_MFSK_ARG_DIR_MODE_CFG_MSB  7
    #define SI446X_CMD_START_MFSK_ARG_DIR_MODE_CFG_LSB  0
    #define SI446X_CMD_START_MFSK_ARG_DIR_MODE_CFG_INDEX 1
    #define SI446X_CMD_START_MFSK_ARG_DIR_MODE_CFG_value (((cmd.arg.RAW[1])))
    #define SI446X_CMD_START_MFSK_ARG_INV_DATA_TYPE bitfield
    #define SI446X_CMD_START_MFSK_ARG_INV_DATA_SIZE 1
    #define SI446X_CMD_START_MFSK_ARG_INV_DATA_MASK 0x40
    #define SI446X_CMD_START_MFSK_ARG_INV_DATA_BIT  0x40
    #define SI446X_CMD_START_MFSK_ARG_INV_DATA_MSB  6
    #define SI446X_CMD_START_MFSK_ARG_INV_DATA_LSB  6
    #define SI446X_CMD_START_MFSK_ARG_INV_DATA_INDEX 1
    #define SI446X_CMD_START_MFSK_ARG_INV_DATA_is_true (cmd.arg.RAW[1]&0x40)
    #define SI446X_CMD_START_MFSK_ARG_INV_DATA_value (((cmd.arg.RAW[1]&0x40))>>6)
    #define SI446X_CMD_START_MFSK_ARG_SCALE_FACTOR_TYPE bitfield
    #define SI446X_CMD_START_MFSK_ARG_SCALE_FACTOR_SIZE 2
    #define SI446X_CMD_START_MFSK_ARG_SCALE_FACTOR_MASK 0x30
    #define SI446X_CMD_START_MFSK_ARG_SCALE_FACTOR_MSB  5
    #define SI446X_CMD_START_MFSK_ARG_SCALE_FACTOR_LSB  4
    #define SI446X_CMD_START_MFSK_ARG_SCALE_FACTOR_INDEX 1
    #define SI446X_CMD_START_MFSK_ARG_SCALE_FACTOR_value (((cmd.arg.RAW[1]&0x30))>>4)
    #define SI446X_CMD_START_MFSK_ARG_MSB_FIRST_TYPE bitfield
    #define SI446X_CMD_START_MFSK_ARG_MSB_FIRST_SIZE 1
    #define SI446X_CMD_START_MFSK_ARG_MSB_FIRST_MASK 0x02
    #define SI446X_CMD_START_MFSK_ARG_MSB_FIRST_BIT  0x02
    #define SI446X_CMD_START_MFSK_ARG_MSB_FIRST_MSB  1
    #define SI446X_CMD_START_MFSK_ARG_MSB_FIRST_LSB  1
    #define SI446X_CMD_START_MFSK_ARG_MSB_FIRST_INDEX 1
    #define SI446X_CMD_START_MFSK_ARG_MSB_FIRST_is_true (cmd.arg.RAW[1]&0x2)
    #define SI446X_CMD_START_MFSK_ARG_MSB_FIRST_value (((cmd.arg.RAW[1]&0x2))>>1)
    #define SI446X_CMD_START_MFSK_ARG_MSB_FIRST_ENUM_LSB_FIRST 0
    #define SI446X_CMD_START_MFSK_ARG_MSB_FIRST_ENUM_MSB_FIRST 1
    #define SI446X_CMD_START_MFSK_ARG_FREQ_OFFSET_TYPE u16
    #define SI446X_CMD_START_MFSK_ARG_FREQ_OFFSET_SIZE 16
    #define SI446X_CMD_START_MFSK_ARG_FREQ_OFFSET_MASK 0xFFFF
    #define SI446X_CMD_START_MFSK_ARG_FREQ_OFFSET_MSB  15
    #define SI446X_CMD_START_MFSK_ARG_FREQ_OFFSET_LSB  0
    #define SI446X_CMD_START_MFSK_ARG_FREQ_OFFSET_INDEX 2
    #define SI446X_CMD_START_MFSK_ARG_FREQ_OFFSET_value (((cmd.arg.RAW_u16[1])))
//START_MFSK REPLY
#define SI446X_CMD_REPLY_COUNT_START_MFSK                                      0

#define SI446X_CMD_ID_RX_HOP                                                   0x36
//RX_HOP ARGS
#define SI446X_CMD_ARG_COUNT_RX_HOP                                            7
    #define SI446X_CMD_RX_HOP_ARG_INTE_TYPE u8
    #define SI446X_CMD_RX_HOP_ARG_INTE_SIZE 8
    #define SI446X_CMD_RX_HOP_ARG_INTE_MASK 0xFF
    #define SI446X_CMD_RX_HOP_ARG_INTE_MSB  7
    #define SI446X_CMD_RX_HOP_ARG_INTE_LSB  0
    #define SI446X_CMD_RX_HOP_ARG_INTE_INDEX 1
    #define SI446X_CMD_RX_HOP_ARG_INTE_value (((cmd.arg.RAW[1])))
    #define SI446X_CMD_RX_HOP_ARG_INTE_MIN 0
    #define SI446X_CMD_RX_HOP_ARG_INTE_MAX 127
    #define SI446X_CMD_RX_HOP_ARG_FRAC2_TYPE u8
    #define SI446X_CMD_RX_HOP_ARG_FRAC2_SIZE 8
    #define SI446X_CMD_RX_HOP_ARG_FRAC2_MASK 0xFF
    #define SI446X_CMD_RX_HOP_ARG_FRAC2_MSB  7
    #define SI446X_CMD_RX_HOP_ARG_FRAC2_LSB  0
    #define SI446X_CMD_RX_HOP_ARG_FRAC2_INDEX 2
    #define SI446X_CMD_RX_HOP_ARG_FRAC2_value (((cmd.arg.RAW[2])))
    #define SI446X_CMD_RX_HOP_ARG_FRAC2_MIN 0
    #define SI446X_CMD_RX_HOP_ARG_FRAC2_MAX 15
    #define SI446X_CMD_RX_HOP_ARG_FRAC1_TYPE u8
    #define SI446X_CMD_RX_HOP_ARG_FRAC1_SIZE 8
    #define SI446X_CMD_RX_HOP_ARG_FRAC1_MASK 0xFF
    #define SI446X_CMD_RX_HOP_ARG_FRAC1_MSB  7
    #define SI446X_CMD_RX_HOP_ARG_FRAC1_LSB  0
    #define SI446X_CMD_RX_HOP_ARG_FRAC1_INDEX 3
    #define SI446X_CMD_RX_HOP_ARG_FRAC1_value (((cmd.arg.RAW[3])))
    #define SI446X_CMD_RX_HOP_ARG_FRAC1_MIN 0
    #define SI446X_CMD_RX_HOP_ARG_FRAC1_MAX 255
    #define SI446X_CMD_RX_HOP_ARG_FRAC0_TYPE u8
    #define SI446X_CMD_RX_HOP_ARG_FRAC0_SIZE 8
    #define SI446X_CMD_RX_HOP_ARG_FRAC0_MASK 0xFF
    #define SI446X_CMD_RX_HOP_ARG_FRAC0_MSB  7
    #define SI446X_CMD_RX_HOP_ARG_FRAC0_LSB  0
    #define SI446X_CMD_RX_HOP_ARG_FRAC0_INDEX 4
    #define SI446X_CMD_RX_HOP_ARG_FRAC0_value (((cmd.arg.RAW[4])))
    #define SI446X_CMD_RX_HOP_ARG_FRAC0_MIN 0
    #define SI446X_CMD_RX_HOP_ARG_FRAC0_MAX 255
    #define SI446X_CMD_RX_HOP_ARG_VCO_CNT1_TYPE u8
    #define SI446X_CMD_RX_HOP_ARG_VCO_CNT1_SIZE 8
    #define SI446X_CMD_RX_HOP_ARG_VCO_CNT1_MASK 0xFF
    #define SI446X_CMD_RX_HOP_ARG_VCO_CNT1_MSB  7
    #define SI446X_CMD_RX_HOP_ARG_VCO_CNT1_LSB  0
    #define SI446X_CMD_RX_HOP_ARG_VCO_CNT1_INDEX 5
    #define SI446X_CMD_RX_HOP_ARG_VCO_CNT1_value (((cmd.arg.RAW[5])))
    #define SI446X_CMD_RX_HOP_ARG_VCO_CNT1_MIN 0
    #define SI446X_CMD_RX_HOP_ARG_VCO_CNT1_MAX 255
    #define SI446X_CMD_RX_HOP_ARG_VCO_CNT0_TYPE u8
    #define SI446X_CMD_RX_HOP_ARG_VCO_CNT0_SIZE 8
    #define SI446X_CMD_RX_HOP_ARG_VCO_CNT0_MASK 0xFF
    #define SI446X_CMD_RX_HOP_ARG_VCO_CNT0_MSB  7
    #define SI446X_CMD_RX_HOP_ARG_VCO_CNT0_LSB  0
    #define SI446X_CMD_RX_HOP_ARG_VCO_CNT0_INDEX 6
    #define SI446X_CMD_RX_HOP_ARG_VCO_CNT0_value (((cmd.arg.RAW[6])))
    #define SI446X_CMD_RX_HOP_ARG_VCO_CNT0_MIN 0
    #define SI446X_CMD_RX_HOP_ARG_VCO_CNT0_MAX 255
//RX_HOP REPLY
#define SI446X_CMD_REPLY_COUNT_RX_HOP                                          0


#define SI446X_CMD_ID_READ_CMD_BUFF                                            0x44
//READ_CMD_BUFF ARGS
#define SI446X_CMD_ARG_COUNT_READ_CMD_BUFF                                     1
//READ_CMD_BUFF REPLY
#define SI446X_CMD_REPLY_COUNT_READ_CMD_BUFF                                   16
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF0_TYPE u8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF0_SIZE 8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF0_MASK 0xFF
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF0_MSB  7
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF0_LSB  0
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF0_INDEX 1
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF1_TYPE u8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF1_SIZE 8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF1_MASK 0xFF
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF1_MSB  7
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF1_LSB  0
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF1_INDEX 2
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF2_TYPE u8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF2_SIZE 8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF2_MASK 0xFF
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF2_MSB  7
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF2_LSB  0
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF2_INDEX 3
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF3_TYPE u8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF3_SIZE 8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF3_MASK 0xFF
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF3_MSB  7
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF3_LSB  0
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF3_INDEX 4
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF4_TYPE u8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF4_SIZE 8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF4_MASK 0xFF
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF4_MSB  7
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF4_LSB  0
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF4_INDEX 5
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF5_TYPE u8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF5_SIZE 8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF5_MASK 0xFF
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF5_MSB  7
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF5_LSB  0
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF5_INDEX 6
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF6_TYPE u8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF6_SIZE 8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF6_MASK 0xFF
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF6_MSB  7
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF6_LSB  0
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF6_INDEX 7
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF7_TYPE u8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF7_SIZE 8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF7_MASK 0xFF
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF7_MSB  7
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF7_LSB  0
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF7_INDEX 8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF8_TYPE u8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF8_SIZE 8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF8_MASK 0xFF
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF8_MSB  7
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF8_LSB  0
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF8_INDEX 9
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF9_TYPE u8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF9_SIZE 8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF9_MASK 0xFF
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF9_MSB  7
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF9_LSB  0
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF9_INDEX 10
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF10_TYPE u8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF10_SIZE 8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF10_MASK 0xFF
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF10_MSB  7
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF10_LSB  0
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF10_INDEX 11
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF11_TYPE u8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF11_SIZE 8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF11_MASK 0xFF
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF11_MSB  7
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF11_LSB  0
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF11_INDEX 12
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF12_TYPE u8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF12_SIZE 8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF12_MASK 0xFF
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF12_MSB  7
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF12_LSB  0
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF12_INDEX 13
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF13_TYPE u8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF13_SIZE 8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF13_MASK 0xFF
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF13_MSB  7
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF13_LSB  0
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF13_INDEX 14
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF14_TYPE u8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF14_SIZE 8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF14_MASK 0xFF
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF14_MSB  7
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF14_LSB  0
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF14_INDEX 15
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF15_TYPE u8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF15_SIZE 8
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF15_MASK 0xFF
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF15_MSB  7
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF15_LSB  0
    #define SI446X_CMD_READ_CMD_BUFF_REP_CMD_BUFF15_INDEX 16

