ld527027363/ESP8266/proj/app/si4463/si446x_defs.h
#define SI446X_PROP_GRP_INDEX_MODEM_MOD_TYPE                                   0
#define SI446X_PROP_GRP_INDEX_MODEM_MAP_CONTROL                                1
#define SI446X_PROP_GRP_INDEX_MODEM_DSM_CTRL                                   2
#define SI446X_PROP_GRP_INDEX_MODEM_DATA_RATE_2                                3
#define SI446X_PROP_GRP_INDEX_MODEM_DATA_RATE_1                                4
#define SI446X_PROP_GRP_INDEX_MODEM_DATA_RATE_0                                5
#define SI446X_PROP_GRP_INDEX_MODEM_TX_NCO_MODE_3                              6
#define SI446X_PROP_GRP_INDEX_MODEM_TX_NCO_MODE_2                              7
#define SI446X_PROP_GRP_INDEX_MODEM_TX_NCO_MODE_1                              8
#define SI446X_PROP_GRP_INDEX_MODEM_TX_NCO_MODE_0                              9
#define SI446X_PROP_GRP_INDEX_MODEM_FREQ_DEV_2                                 10
#define SI446X_PROP_GRP_INDEX_MODEM_FREQ_DEV_1                                 11
#define SI446X_PROP_GRP_INDEX_MODEM_FREQ_DEV_0                                 12
#define SI446X_PROP_GRP_INDEX_MODEM_FREQ_OFFSET_1                              13
#define SI446X_PROP_GRP_INDEX_MODEM_FREQ_OFFSET_0                              14
#define SI446X_PROP_GRP_INDEX_MODEM_TX_FILTER_COEFF_8                          15
#define SI446X_PROP_GRP_INDEX_MODEM_TX_FILTER_COEFF_7                          16
#define SI446X_PROP_GRP_INDEX_MODEM_TX_FILTER_COEFF_6                          17
#define SI446X_PROP_GRP_INDEX_MODEM_TX_FILTER_COEFF_5                          18
#define SI446X_PROP_GRP_INDEX_MODEM_TX_FILTER_COEFF_4                          19
#define SI446X_PROP_GRP_INDEX_MODEM_TX_FILTER_COEFF_3                          20
#define SI446X_PROP_GRP_INDEX_MODEM_TX_FILTER_COEFF_2                          21
#define SI446X_PROP_GRP_INDEX_MODEM_TX_FILTER_COEFF_1                          22
#define SI446X_PROP_GRP_INDEX_MODEM_TX_FILTER_COEFF_0                          23
#define SI446X_PROP_GRP_INDEX_MODEM_TX_RAMP_DELAY                              24
#define SI446X_PROP_GRP_INDEX_MODEM_MDM_CTRL                                   25
#define SI446X_PROP_GRP_INDEX_MODEM_IF_CONTROL                                 26
#define SI446X_PROP_GRP_INDEX_MODEM_IF_FREQ_2                                  27
#define SI446X_PROP_GRP_INDEX_MODEM_IF_FREQ_1                                  28
#define SI446X_PROP_GRP_INDEX_MODEM_IF_FREQ_0                                  29
#define SI446X_PROP_GRP_INDEX_MODEM_DECIMATION_CFG1                            30
#define SI446X_PROP_GRP_INDEX_MODEM_DECIMATION_CFG0                            31
#define SI446X_PROP_GRP_INDEX_MODEM_OOKZEROIF_FDEV_1                           32
#define SI446X_PROP_GRP_INDEX_MODEM_OOKZEROIF_FDEV_0                           33
#define SI446X_PROP_GRP_INDEX_MODEM_BCR_OSR_1                                  34
#define SI446X_PROP_GRP_INDEX_MODEM_BCR_OSR_0                                  35
#define SI446X_PROP_GRP_INDEX_MODEM_BCR_NCO_OFFSET_2                           36
#define SI446X_PROP_GRP_INDEX_MODEM_BCR_NCO_OFFSET_1                           37
#define SI446X_PROP_GRP_INDEX_MODEM_BCR_NCO_OFFSET_0                           38
#define SI446X_PROP_GRP_INDEX_MODEM_BCR_GAIN_1                                 39
#define SI446X_PROP_GRP_INDEX_MODEM_BCR_GAIN_0                                 40
#define SI446X_PROP_GRP_INDEX_MODEM_BCR_GEAR                                   41
#define SI446X_PROP_GRP_INDEX_MODEM_BCR_MISC1                                  42
#define SI446X_PROP_GRP_INDEX_MODEM_BCR_MISC0                                  43
#define SI446X_PROP_GRP_INDEX_MODEM_AFC_GEAR                                   44
#define SI446X_PROP_GRP_INDEX_MODEM_AFC_WAIT                                   45
#define SI446X_PROP_GRP_INDEX_MODEM_AFC_GAIN_1                                 46
#define SI446X_PROP_GRP_INDEX_MODEM_AFC_GAIN_0                                 47
#define SI446X_PROP_GRP_INDEX_MODEM_AFC_LIMITER_1                              48
#define SI446X_PROP_GRP_INDEX_MODEM_AFC_LIMITER_0                              49
#define SI446X_PROP_GRP_INDEX_MODEM_AFC_MISC                                   50
#define SI446X_PROP_GRP_INDEX_MODEM_AFC_ZIFOFF                                 51
#define SI446X_PROP_GRP_INDEX_MODEM_ADC_CTRL                                   52
#define SI446X_PROP_GRP_INDEX_MODEM_AGC_CONTROL                                53
#define SI446X_PROP_GRP_INDEX_MODEM_OOKZEROIF_RB_2                             54
#define SI446X_PROP_GRP_INDEX_MODEM_OOKZEROIF_RB_1                             55
#define SI446X_PROP_GRP_INDEX_MODEM_AGC_WINDOW_SIZE                            56
#define SI446X_PROP_GRP_INDEX_MODEM_AGC_RFPD_DECAY                             57
#define SI446X_PROP_GRP_INDEX_MODEM_AGC_IFPD_DECAY                             58
#define SI446X_PROP_GRP_INDEX_MODEM_FSK4_GAIN1                                 59
#define SI446X_PROP_GRP_INDEX_MODEM_FSK4_GAIN0                                 60
#define SI446X_PROP_GRP_INDEX_MODEM_FSK4_TH1                                   61
#define SI446X_PROP_GRP_INDEX_MODEM_FSK4_TH0                                   62
#define SI446X_PROP_GRP_INDEX_MODEM_FSK4_MAP                                   63
#define SI446X_PROP_GRP_INDEX_MODEM_OOK_PDTC                                   64
#define SI446X_PROP_GRP_INDEX_MODEM_OOK_BLOPK                                  65
#define SI446X_PROP_GRP_INDEX_MODEM_OOK_CNT1                                   66
#define SI446X_PROP_GRP_INDEX_MODEM_OOK_MISC                                   67
#define SI446X_PROP_GRP_INDEX_MODEM_RAW_SEARCH                                 68
#define SI446X_PROP_GRP_INDEX_MODEM_RAW_CONTROL                                69
#define SI446X_PROP_GRP_INDEX_MODEM_RAW_EYE_1                                  70
#define SI446X_PROP_GRP_INDEX_MODEM_RAW_EYE_0                                  71
#define SI446X_PROP_GRP_INDEX_MODEM_ANT_DIV_MODE                               72
#define SI446X_PROP_GRP_INDEX_MODEM_ANT_DIV_CONTROL                            73
#define SI446X_PROP_GRP_INDEX_MODEM_RSSI_THRESH                                74
#define SI446X_PROP_GRP_INDEX_MODEM_RSSI_JUMP_THRESH                           75
#define SI446X_PROP_GRP_INDEX_MODEM_RSSI_CONTROL                               76
#define SI446X_PROP_GRP_INDEX_MODEM_RSSI_CONTROL2                              77
#define SI446X_PROP_GRP_INDEX_MODEM_RSSI_COMP                                  78
#define SI446X_PROP_GRP_INDEX_MODEM_DC_CONTROL                                 79
#define SI446X_PROP_GRP_INDEX_MODEM_OOKZEROIF_RB_0                             80
#define SI446X_PROP_GRP_INDEX_MODEM_CLKGEN_BAND                                81
#define SI446X_PROP_GRP_INDEX_MODEM_RESERVED_20_52                             82
#define SI446X_PROP_GRP_INDEX_MODEM_PLL_SETTLE_TIME                            83

#define SI446X_PROP_GRP_INDEX_FRR_CTL_A_MODE                                   0
#define SI446X_PROP_GRP_INDEX_FRR_CTL_B_MODE                                   1
#define SI446X_PROP_GRP_INDEX_FRR_CTL_C_MODE                                   2
#define SI446X_PROP_GRP_INDEX_FRR_CTL_D_MODE                                   3

#define SI446X_PROP_GRP_INDEX_INT_CTL_ENABLE                                   0
#define SI446X_PROP_GRP_INDEX_INT_CTL_PH_ENABLE                                1
#define SI446X_PROP_GRP_INDEX_INT_CTL_MODEM_ENABLE                             2
#define SI446X_PROP_GRP_INDEX_INT_CTL_CHIP_ENABLE                              3

#define SI446X_PROP_GRP_INDEX_SYNC_CONFIG                                      0
#define SI446X_PROP_GRP_INDEX_SYNC_BITS_31_24                                  1
#define SI446X_PROP_GRP_INDEX_SYNC_BITS_23_16                                  2
#define SI446X_PROP_GRP_INDEX_SYNC_BITS_15_8                                   3
#define SI446X_PROP_GRP_INDEX_SYNC_BITS_7_0                                    4

