ld527027363/ESP8266/proj/app/si4463/si446x_defs.h
#define SI446X_PROP_PREAMBLE_TX_LENGTH_MASK                                    0xFF
#define SI446X_PROP_PREAMBLE_TX_LENGTH_DEFAULT                                 0x08
#define SI446X_PROP_PREAMBLE_TX_LENGTH_TX_LENGTH_SIZE                          8
#define SI446X_PROP_PREAMBLE_TX_LENGTH_TX_LENGTH_LSB                           0
#define SI446X_PROP_PREAMBLE_TX_LENGTH_TX_LENGTH_MSB                           7
#define SI446X_PROP_PREAMBLE_TX_LENGTH_TX_LENGTH_MIN                           0
#define SI446X_PROP_PREAMBLE_TX_LENGTH_TX_LENGTH_MAX                           255
#define SI446X_PROP_PREAMBLE_TX_LENGTH_TX_LENGTH_MASK                          0xFF

#define SI446X_PROP_PREAMBLE_CONFIG_STD_1_MASK                                 0xFF
#define SI446X_PROP_PREAMBLE_CONFIG_STD_1_DEFAULT                              0x14
#define SI446X_PROP_PREAMBLE_CONFIG_STD_1_SKIP_SYNC_TIMEOUT_SIZE               1
#define SI446X_PROP_PREAMBLE_CONFIG_STD_1_SKIP_SYNC_TIMEOUT_LSB                7
#define SI446X_PROP_PREAMBLE_CONFIG_STD_1_SKIP_SYNC_TIMEOUT_MSB                7
#define SI446X_PROP_PREAMBLE_CONFIG_STD_1_SKIP_SYNC_TIMEOUT_MASK               0x80
#define SI446X_PROP_PREAMBLE_CONFIG_STD_1_SKIP_SYNC_TIMEOUT_BIT                0x80
#define SI446X_PROP_PREAMBLE_CONFIG_STD_1_SKIP_SYNC_TIMEOUT_ENUM_ENABLE        0x1
#define SI446X_PROP_PREAMBLE_CONFIG_STD_1_RX_THRESH_SIZE                       7
#define SI446X_PROP_PREAMBLE_CONFIG_STD_1_RX_THRESH_LSB                        0
#define SI446X_PROP_PREAMBLE_CONFIG_STD_1_RX_THRESH_MSB                        6
#define SI446X_PROP_PREAMBLE_CONFIG_STD_1_RX_THRESH_MIN                        0
#define SI446X_PROP_PREAMBLE_CONFIG_STD_1_RX_THRESH_MAX                        127
#define SI446X_PROP_PREAMBLE_CONFIG_STD_1_RX_THRESH_MASK                       0x7F

#define SI446X_PROP_PREAMBLE_CONFIG_NSTD_MASK                                  0xFF
#define SI446X_PROP_PREAMBLE_CONFIG_NSTD_DEFAULT                               0x00
#define SI446X_PROP_PREAMBLE_CONFIG_NSTD_RX_ERRORS_SIZE                        3
#define SI446X_PROP_PREAMBLE_CONFIG_NSTD_RX_ERRORS_LSB                         5
#define SI446X_PROP_PREAMBLE_CONFIG_NSTD_RX_ERRORS_MSB                         7
#define SI446X_PROP_PREAMBLE_CONFIG_NSTD_RX_ERRORS_MIN                         0
#define SI446X_PROP_PREAMBLE_CONFIG_NSTD_RX_ERRORS_MAX                         7
#define SI446X_PROP_PREAMBLE_CONFIG_NSTD_RX_ERRORS_MASK                        0xE0
#define SI446X_PROP_PREAMBLE_CONFIG_NSTD_PATTERN_LENGTH_SIZE                   5
#define SI446X_PROP_PREAMBLE_CONFIG_NSTD_PATTERN_LENGTH_LSB                    0
#define SI446X_PROP_PREAMBLE_CONFIG_NSTD_PATTERN_LENGTH_MSB                    4
#define SI446X_PROP_PREAMBLE_CONFIG_NSTD_PATTERN_LENGTH_MIN                    0
#define SI446X_PROP_PREAMBLE_CONFIG_NSTD_PATTERN_LENGTH_MAX                    31
#define SI446X_PROP_PREAMBLE_CONFIG_NSTD_PATTERN_LENGTH_MASK                   0x1F

#define SI446X_PROP_PREAMBLE_CONFIG_STD_2_MASK                                 0xFF
#define SI446X_PROP_PREAMBLE_CONFIG_STD_2_DEFAULT                              0x0F
#define SI446X_PROP_PREAMBLE_CONFIG_STD_2_RX_PREAMBLE_TIMEOUT_EXTEND_SIZE      4
#define SI446X_PROP_PREAMBLE_CONFIG_STD_2_RX_PREAMBLE_TIMEOUT_EXTEND_LSB       4
#define SI446X_PROP_PREAMBLE_CONFIG_STD_2_RX_PREAMBLE_TIMEOUT_EXTEND_MSB       7
#define SI446X_PROP_PREAMBLE_CONFIG_STD_2_RX_PREAMBLE_TIMEOUT_EXTEND_MIN       0
#define SI446X_PROP_PREAMBLE_CONFIG_STD_2_RX_PREAMBLE_TIMEOUT_EXTEND_MAX       15
#define SI446X_PROP_PREAMBLE_CONFIG_STD_2_RX_PREAMBLE_TIMEOUT_EXTEND_MASK      0xF0
#define SI446X_PROP_PREAMBLE_CONFIG_STD_2_RX_PREAMBLE_TIMEOUT_SIZE             4
#define SI446X_PROP_PREAMBLE_CONFIG_STD_2_RX_PREAMBLE_TIMEOUT_LSB              0
#define SI446X_PROP_PREAMBLE_CONFIG_STD_2_RX_PREAMBLE_TIMEOUT_MSB              3
#define SI446X_PROP_PREAMBLE_CONFIG_STD_2_RX_PREAMBLE_TIMEOUT_MIN              0
#define SI446X_PROP_PREAMBLE_CONFIG_STD_2_RX_PREAMBLE_TIMEOUT_MAX              15
#define SI446X_PROP_PREAMBLE_CONFIG_STD_2_RX_PREAMBLE_TIMEOUT_MASK             0xF

#define SI446X_PROP_PREAMBLE_CONFIG_MASK                                       0xFF
#define SI446X_PROP_PREAMBLE_CONFIG_DEFAULT                                    0x21
#define SI446X_PROP_PREAMBLE_CONFIG_PREAM_FIRST_1_OR_0_SIZE                    1
#define SI446X_PROP_PREAMBLE_CONFIG_PREAM_FIRST_1_OR_0_LSB                     5
#define SI446X_PROP_PREAMBLE_CONFIG_PREAM_FIRST_1_OR_0_MSB                     5
#define SI446X_PROP_PREAMBLE_CONFIG_PREAM_FIRST_1_OR_0_MASK                    0x20
#define SI446X_PROP_PREAMBLE_CONFIG_PREAM_FIRST_1_OR_0_BIT                     0x20
#define SI446X_PROP_PREAMBLE_CONFIG_PREAM_FIRST_1_OR_0_ENUM_FIRST_0            0x0
#define SI446X_PROP_PREAMBLE_CONFIG_PREAM_FIRST_1_OR_0_ENUM_FIRST_1            0x1
#define SI446X_PROP_PREAMBLE_CONFIG_LENGTH_CONFIG_SIZE                         1
#define SI446X_PROP_PREAMBLE_CONFIG_LENGTH_CONFIG_LSB                          4
#define SI446X_PROP_PREAMBLE_CONFIG_LENGTH_CONFIG_MSB                          4
#define SI446X_PROP_PREAMBLE_CONFIG_LENGTH_CONFIG_MASK                         0x10
#define SI446X_PROP_PREAMBLE_CONFIG_LENGTH_CONFIG_BIT                          0x10
#define SI446X_PROP_PREAMBLE_CONFIG_LENGTH_CONFIG_ENUM_NIBBLE                  0x0
#define SI446X_PROP_PREAMBLE_CONFIG_LENGTH_CONFIG_ENUM_BYTE                    0x1
#define SI446X_PROP_PREAMBLE_CONFIG_MAN_CONST_SIZE                             1
#define SI446X_PROP_PREAMBLE_CONFIG_MAN_CONST_LSB                              3
#define SI446X_PROP_PREAMBLE_CONFIG_MAN_CONST_MSB                              3
#define SI446X_PROP_PREAMBLE_CONFIG_MAN_CONST_MASK                             0x8
#define SI446X_PROP_PREAMBLE_CONFIG_MAN_CONST_BIT                              0x8
#define SI446X_PROP_PREAMBLE_CONFIG_MAN_CONST_ENUM_NO_CON                      0x0
#define SI446X_PROP_PREAMBLE_CONFIG_MAN_CONST_ENUM_CONST                       0x1
#define SI446X_PROP_PREAMBLE_CONFIG_MAN_ENABLE_SIZE                            1
#define SI446X_PROP_PREAMBLE_CONFIG_MAN_ENABLE_LSB                             2
#define SI446X_PROP_PREAMBLE_CONFIG_MAN_ENABLE_MSB                             2
#define SI446X_PROP_PREAMBLE_CONFIG_MAN_ENABLE_MASK                            0x4
#define SI446X_PROP_PREAMBLE_CONFIG_MAN_ENABLE_BIT                             0x4
#define SI446X_PROP_PREAMBLE_CONFIG_MAN_ENABLE_ENUM_NO_MAN                     0x0
#define SI446X_PROP_PREAMBLE_CONFIG_MAN_ENABLE_ENUM_EN_MAN                     0x1
#define SI446X_PROP_PREAMBLE_CONFIG_STANDARD_PREAM_SIZE                        2
#define SI446X_PROP_PREAMBLE_CONFIG_STANDARD_PREAM_LSB                         0
#define SI446X_PROP_PREAMBLE_CONFIG_STANDARD_PREAM_MSB                         1
#define SI446X_PROP_PREAMBLE_CONFIG_STANDARD_PREAM_MASK                        0x3
#define SI446X_PROP_PREAMBLE_CONFIG_STANDARD_PREAM_ENUM_PRE_NS                 0x0
#define SI446X_PROP_PREAMBLE_CONFIG_STANDARD_PREAM_ENUM_PRE_1010               0x1
#define SI446X_PROP_PREAMBLE_CONFIG_STANDARD_PREAM_ENUM_PRE_0101               0x2

#define SI446X_PROP_PREAMBLE_PATTERN_31_24_MASK                                0xFF
#define SI446X_PROP_PREAMBLE_PATTERN_31_24_DEFAULT                             0
#define SI446X_PROP_PREAMBLE_PATTERN_31_24_PATTERN_31_24_SIZE                  8
#define SI446X_PROP_PREAMBLE_PATTERN_31_24_PATTERN_31_24_LSB                   0
#define SI446X_PROP_PREAMBLE_PATTERN_31_24_PATTERN_31_24_MSB                   7
#define SI446X_PROP_PREAMBLE_PATTERN_31_24_PATTERN_31_24_MIN                   0
#define SI446X_PROP_PREAMBLE_PATTERN_31_24_PATTERN_31_24_MAX                   0xff
#define SI446X_PROP_PREAMBLE_PATTERN_31_24_PATTERN_31_24_MASK                  0xFF

