ld527027363/ESP8266/proj/app/si4463/si446x_defs.h
#define SI446X_PROP_PKT_FIELD_2_LENGTH_7_0_MASK                                0xFF
#define SI446X_PROP_PKT_FIELD_2_LENGTH_7_0_DEFAULT                             0x00
#define SI446X_PROP_PKT_FIELD_2_LENGTH_7_0_FIELD_2_LENGTH_7_0_SIZE             8
#define SI446X_PROP_PKT_FIELD_2_LENGTH_7_0_FIELD_2_LENGTH_7_0_LSB              0
#define SI446X_PROP_PKT_FIELD_2_LENGTH_7_0_FIELD_2_LENGTH_7_0_MSB              7
#define SI446X_PROP_PKT_FIELD_2_LENGTH_7_0_FIELD_2_LENGTH_7_0_MIN              0
#define SI446X_PROP_PKT_FIELD_2_LENGTH_7_0_FIELD_2_LENGTH_7_0_MAX              0xff
#define SI446X_PROP_PKT_FIELD_2_LENGTH_7_0_FIELD_2_LENGTH_7_0_MASK             0xFF

#define SI446X_PROP_PKT_FIELD_2_CONFIG_MASK                                    0xFF
#define SI446X_PROP_PKT_FIELD_2_CONFIG_DEFAULT                                 0x00
#define SI446X_PROP_PKT_FIELD_2_CONFIG_4FSK_SIZE                               1
#define SI446X_PROP_PKT_FIELD_2_CONFIG_4FSK_LSB                                4
#define SI446X_PROP_PKT_FIELD_2_CONFIG_4FSK_MSB                                4
#define SI446X_PROP_PKT_FIELD_2_CONFIG_4FSK_MASK                               0x10
#define SI446X_PROP_PKT_FIELD_2_CONFIG_4FSK_BIT                                0x10
#define SI446X_PROP_PKT_FIELD_2_CONFIG_RESERVED_SIZE                           1
#define SI446X_PROP_PKT_FIELD_2_CONFIG_RESERVED_LSB                            2
#define SI446X_PROP_PKT_FIELD_2_CONFIG_RESERVED_MSB                            2
#define SI446X_PROP_PKT_FIELD_2_CONFIG_RESERVED_MASK                           0x4
#define SI446X_PROP_PKT_FIELD_2_CONFIG_RESERVED_BIT                            0x4
#define SI446X_PROP_PKT_FIELD_2_CONFIG_WHITEN_SIZE                             1
#define SI446X_PROP_PKT_FIELD_2_CONFIG_WHITEN_LSB                              1
#define SI446X_PROP_PKT_FIELD_2_CONFIG_WHITEN_MSB                              1
#define SI446X_PROP_PKT_FIELD_2_CONFIG_WHITEN_MASK                             0x2
#define SI446X_PROP_PKT_FIELD_2_CONFIG_WHITEN_BIT                              0x2
#define SI446X_PROP_PKT_FIELD_2_CONFIG_MANCH_SIZE                              1
#define SI446X_PROP_PKT_FIELD_2_CONFIG_MANCH_LSB                               0
#define SI446X_PROP_PKT_FIELD_2_CONFIG_MANCH_MSB                               0
#define SI446X_PROP_PKT_FIELD_2_CONFIG_MANCH_MASK                              0x1
#define SI446X_PROP_PKT_FIELD_2_CONFIG_MANCH_BIT                               0x1

#define SI446X_PROP_PKT_FIELD_2_CRC_CONFIG_MASK                                0xFF
#define SI446X_PROP_PKT_FIELD_2_CRC_CONFIG_DEFAULT                             0x00
#define SI446X_PROP_PKT_FIELD_2_CRC_CONFIG_RESERVED_SIZE                       2
#define SI446X_PROP_PKT_FIELD_2_CRC_CONFIG_RESERVED_LSB                        6
#define SI446X_PROP_PKT_FIELD_2_CRC_CONFIG_RESERVED_MSB                        7
#define SI446X_PROP_PKT_FIELD_2_CRC_CONFIG_RESERVED_MASK                       0xC0
#define SI446X_PROP_PKT_FIELD_2_CRC_CONFIG_SEND_CRC_SIZE                       1
#define SI446X_PROP_PKT_FIELD_2_CRC_CONFIG_SEND_CRC_LSB                        5
#define SI446X_PROP_PKT_FIELD_2_CRC_CONFIG_SEND_CRC_MSB                        5
#define SI446X_PROP_PKT_FIELD_2_CRC_CONFIG_SEND_CRC_MASK                       0x20
#define SI446X_PROP_PKT_FIELD_2_CRC_CONFIG_SEND_CRC_BIT                        0x20
#define SI446X_PROP_PKT_FIELD_2_CRC_CONFIG_CHECK_CRC_SIZE                      1
#define SI446X_PROP_PKT_FIELD_2_CRC_CONFIG_CHECK_CRC_LSB                       3
#define SI446X_PROP_PKT_FIELD_2_CRC_CONFIG_CHECK_CRC_MSB                       3
#define SI446X_PROP_PKT_FIELD_2_CRC_CONFIG_CHECK_CRC_MASK                      0x8
#define SI446X_PROP_PKT_FIELD_2_CRC_CONFIG_CHECK_CRC_BIT                       0x8
#define SI446X_PROP_PKT_FIELD_2_CRC_CONFIG_CRC_ENABLE_SIZE                     1
#define SI446X_PROP_PKT_FIELD_2_CRC_CONFIG_CRC_ENABLE_LSB                      1
#define SI446X_PROP_PKT_FIELD_2_CRC_CONFIG_CRC_ENABLE_MSB                      1
#define SI446X_PROP_PKT_FIELD_2_CRC_CONFIG_CRC_ENABLE_MASK                     0x2
#define SI446X_PROP_PKT_FIELD_2_CRC_CONFIG_CRC_ENABLE_BIT                      0x2

#define SI446X_PROP_PKT_FIELD_3_LENGTH_12_8_MASK                               0xFF
#define SI446X_PROP_PKT_FIELD_3_LENGTH_12_8_DEFAULT                            0x00
#define SI446X_PROP_PKT_FIELD_3_LENGTH_12_8_FIELD_3_LENGTH_12_8_SIZE           5
#define SI446X_PROP_PKT_FIELD_3_LENGTH_12_8_FIELD_3_LENGTH_12_8_LSB            0
#define SI446X_PROP_PKT_FIELD_3_LENGTH_12_8_FIELD_3_LENGTH_12_8_MSB            4
#define SI446X_PROP_PKT_FIELD_3_LENGTH_12_8_FIELD_3_LENGTH_12_8_MASK           0x1F

#define SI446X_PROP_PKT_FIELD_3_LENGTH_7_0_MASK                                0xFF
#define SI446X_PROP_PKT_FIELD_3_LENGTH_7_0_DEFAULT                             0x00
#define SI446X_PROP_PKT_FIELD_3_LENGTH_7_0_FIELD_3_LENGTH_7_0_SIZE             8
#define SI446X_PROP_PKT_FIELD_3_LENGTH_7_0_FIELD_3_LENGTH_7_0_LSB              0
#define SI446X_PROP_PKT_FIELD_3_LENGTH_7_0_FIELD_3_LENGTH_7_0_MSB              7
#define SI446X_PROP_PKT_FIELD_3_LENGTH_7_0_FIELD_3_LENGTH_7_0_MIN              0
#define SI446X_PROP_PKT_FIELD_3_LENGTH_7_0_FIELD_3_LENGTH_7_0_MAX              0xff
#define SI446X_PROP_PKT_FIELD_3_LENGTH_7_0_FIELD_3_LENGTH_7_0_MASK             0xFF

#define SI446X_PROP_PKT_FIELD_3_CONFIG_MASK                                    0xFF
#define SI446X_PROP_PKT_FIELD_3_CONFIG_DEFAULT                                 0x00
#define SI446X_PROP_PKT_FIELD_3_CONFIG_4FSK_SIZE                               1
#define SI446X_PROP_PKT_FIELD_3_CONFIG_4FSK_LSB                                4
#define SI446X_PROP_PKT_FIELD_3_CONFIG_4FSK_MSB                                4
#define SI446X_PROP_PKT_FIELD_3_CONFIG_4FSK_MASK                               0x10
#define SI446X_PROP_PKT_FIELD_3_CONFIG_4FSK_BIT                                0x10
#define SI446X_PROP_PKT_FIELD_3_CONFIG_RESERVED_SIZE                           1
#define SI446X_PROP_PKT_FIELD_3_CONFIG_RESERVED_LSB                            2
#define SI446X_PROP_PKT_FIELD_3_CONFIG_RESERVED_MSB                            2
#define SI446X_PROP_PKT_FIELD_3_CONFIG_RESERVED_MASK                           0x4
#define SI446X_PROP_PKT_FIELD_3_CONFIG_RESERVED_BIT                            0x4
#define SI446X_PROP_PKT_FIELD_3_CONFIG_WHITEN_SIZE                             1
#define SI446X_PROP_PKT_FIELD_3_CONFIG_WHITEN_LSB                              1
#define SI446X_PROP_PKT_FIELD_3_CONFIG_WHITEN_MSB                              1
#define SI446X_PROP_PKT_FIELD_3_CONFIG_WHITEN_MASK                             0x2
#define SI446X_PROP_PKT_FIELD_3_CONFIG_WHITEN_BIT                              0x2
#define SI446X_PROP_PKT_FIELD_3_CONFIG_MANCH_SIZE                              1
#define SI446X_PROP_PKT_FIELD_3_CONFIG_MANCH_LSB                               0
#define SI446X_PROP_PKT_FIELD_3_CONFIG_MANCH_MSB                               0
#define SI446X_PROP_PKT_FIELD_3_CONFIG_MANCH_MASK                              0x1
#define SI446X_PROP_PKT_FIELD_3_CONFIG_MANCH_BIT                               0x1

#define SI446X_PROP_PKT_FIELD_3_CRC_CONFIG_MASK                                0xFF
#define SI446X_PROP_PKT_FIELD_3_CRC_CONFIG_DEFAULT                             0x00
#define SI446X_PROP_PKT_FIELD_3_CRC_CONFIG_RESERVED_SIZE                       2
#define SI446X_PROP_PKT_FIELD_3_CRC_CONFIG_RESERVED_LSB                        6
#define SI446X_PROP_PKT_FIELD_3_CRC_CONFIG_RESERVED_MSB                        7
#define SI446X_PROP_PKT_FIELD_3_CRC_CONFIG_RESERVED_MASK                       0xC0
#define SI446X_PROP_PKT_FIELD_3_CRC_CONFIG_SEND_CRC_SIZE                       1
#define SI446X_PROP_PKT_FIELD_3_CRC_CONFIG_SEND_CRC_LSB                        5
#define SI446X_PROP_PKT_FIELD_3_CRC_CONFIG_SEND_CRC_MSB                        5
#define SI446X_PROP_PKT_FIELD_3_CRC_CONFIG_SEND_CRC_MASK                       0x20
#define SI446X_PROP_PKT_FIELD_3_CRC_CONFIG_SEND_CRC_BIT                        0x20
#define SI446X_PROP_PKT_FIELD_3_CRC_CONFIG_CHECK_CRC_SIZE                      1
#define SI446X_PROP_PKT_FIELD_3_CRC_CONFIG_CHECK_CRC_LSB                       3
#define SI446X_PROP_PKT_FIELD_3_CRC_CONFIG_CHECK_CRC_MSB                       3
#define SI446X_PROP_PKT_FIELD_3_CRC_CONFIG_CHECK_CRC_MASK                      0x8
#define SI446X_PROP_PKT_FIELD_3_CRC_CONFIG_CHECK_CRC_BIT                       0x8
#define SI446X_PROP_PKT_FIELD_3_CRC_CONFIG_CRC_ENABLE_SIZE                     1
#define SI446X_PROP_PKT_FIELD_3_CRC_CONFIG_CRC_ENABLE_LSB                      1
#define SI446X_PROP_PKT_FIELD_3_CRC_CONFIG_CRC_ENABLE_MSB                      1
#define SI446X_PROP_PKT_FIELD_3_CRC_CONFIG_CRC_ENABLE_MASK                     0x2
#define SI446X_PROP_PKT_FIELD_3_CRC_CONFIG_CRC_ENABLE_BIT                      0x2

#define SI446X_PROP_PKT_FIELD_4_LENGTH_12_8_MASK                               0xFF
#define SI446X_PROP_PKT_FIELD_4_LENGTH_12_8_DEFAULT                            0x00
#define SI446X_PROP_PKT_FIELD_4_LENGTH_12_8_FIELD_4_LENGTH_12_8_SIZE           5
#define SI446X_PROP_PKT_FIELD_4_LENGTH_12_8_FIELD_4_LENGTH_12_8_LSB            0
#define SI446X_PROP_PKT_FIELD_4_LENGTH_12_8_FIELD_4_LENGTH_12_8_MSB            4
#define SI446X_PROP_PKT_FIELD_4_LENGTH_12_8_FIELD_4_LENGTH_12_8_MASK           0x1F

#define SI446X_PROP_PKT_FIELD_4_LENGTH_7_0_MASK                                0xFF
#define SI446X_PROP_PKT_FIELD_4_LENGTH_7_0_DEFAULT                             0x00
#define SI446X_PROP_PKT_FIELD_4_LENGTH_7_0_FIELD_4_LENGTH_7_0_SIZE             8
#define SI446X_PROP_PKT_FIELD_4_LENGTH_7_0_FIELD_4_LENGTH_7_0_LSB              0
#define SI446X_PROP_PKT_FIELD_4_LENGTH_7_0_FIELD_4_LENGTH_7_0_MSB              7
#define SI446X_PROP_PKT_FIELD_4_LENGTH_7_0_FIELD_4_LENGTH_7_0_MIN              0
#define SI446X_PROP_PKT_FIELD_4_LENGTH_7_0_FIELD_4_LENGTH_7_0_MAX              0xff
#define SI446X_PROP_PKT_FIELD_4_LENGTH_7_0_FIELD_4_LENGTH_7_0_MASK             0xFF

#define SI446X_PROP_PKT_FIELD_4_CONFIG_MASK                                    0xFF
#define SI446X_PROP_PKT_FIELD_4_CONFIG_DEFAULT                                 0x00
#define SI446X_PROP_PKT_FIELD_4_CONFIG_4FSK_SIZE                               1
#define SI446X_PROP_PKT_FIELD_4_CONFIG_4FSK_LSB                                4
#define SI446X_PROP_PKT_FIELD_4_CONFIG_4FSK_MSB                                4
#define SI446X_PROP_PKT_FIELD_4_CONFIG_4FSK_MASK                               0x10
#define SI446X_PROP_PKT_FIELD_4_CONFIG_4FSK_BIT                                0x10
#define SI446X_PROP_PKT_FIELD_4_CONFIG_RESERVED_SIZE                           1
#define SI446X_PROP_PKT_FIELD_4_CONFIG_RESERVED_LSB                            2
#define SI446X_PROP_PKT_FIELD_4_CONFIG_RESERVED_MSB                            2
#define SI446X_PROP_PKT_FIELD_4_CONFIG_RESERVED_MASK                           0x4
#define SI446X_PROP_PKT_FIELD_4_CONFIG_RESERVED_BIT                            0x4
#define SI446X_PROP_PKT_FIELD_4_CONFIG_WHITEN_SIZE                             1
#define SI446X_PROP_PKT_FIELD_4_CONFIG_WHITEN_LSB                              1
#define SI446X_PROP_PKT_FIELD_4_CONFIG_WHITEN_MSB                              1
#define SI446X_PROP_PKT_FIELD_4_CONFIG_WHITEN_MASK                             0x2
#define SI446X_PROP_PKT_FIELD_4_CONFIG_WHITEN_BIT                              0x2
#define SI446X_PROP_PKT_FIELD_4_CONFIG_MANCH_SIZE                              1
#define SI446X_PROP_PKT_FIELD_4_CONFIG_MANCH_LSB                               0
#define SI446X_PROP_PKT_FIELD_4_CONFIG_MANCH_MSB                               0
#define SI446X_PROP_PKT_FIELD_4_CONFIG_MANCH_MASK                              0x1
#define SI446X_PROP_PKT_FIELD_4_CONFIG_MANCH_BIT                               0x1

#define SI446X_PROP_PKT_FIELD_4_CRC_CONFIG_MASK                                0xFF
#define SI446X_PROP_PKT_FIELD_4_CRC_CONFIG_DEFAULT                             0x00
#define SI446X_PROP_PKT_FIELD_4_CRC_CONFIG_RESERVED_SIZE                       2
#define SI446X_PROP_PKT_FIELD_4_CRC_CONFIG_RESERVED_LSB                        6
#define SI446X_PROP_PKT_FIELD_4_CRC_CONFIG_RESERVED_MSB                        7
#define SI446X_PROP_PKT_FIELD_4_CRC_CONFIG_RESERVED_MASK                       0xC0
#define SI446X_PROP_PKT_FIELD_4_CRC_CONFIG_SEND_CRC_SIZE                       1
#define SI446X_PROP_PKT_FIELD_4_CRC_CONFIG_SEND_CRC_LSB                        5
#define SI446X_PROP_PKT_FIELD_4_CRC_CONFIG_SEND_CRC_MSB                        5
#define SI446X_PROP_PKT_FIELD_4_CRC_CONFIG_SEND_CRC_MASK                       0x20
#define SI446X_PROP_PKT_FIELD_4_CRC_CONFIG_SEND_CRC_BIT                        0x20
#define SI446X_PROP_PKT_FIELD_4_CRC_CONFIG_CHECK_CRC_SIZE                      1
#define SI446X_PROP_PKT_FIELD_4_CRC_CONFIG_CHECK_CRC_LSB                       3
#define SI446X_PROP_PKT_FIELD_4_CRC_CONFIG_CHECK_CRC_MSB                       3
#define SI446X_PROP_PKT_FIELD_4_CRC_CONFIG_CHECK_CRC_MASK                      0x8
#define SI446X_PROP_PKT_FIELD_4_CRC_CONFIG_CHECK_CRC_BIT                       0x8
#define SI446X_PROP_PKT_FIELD_4_CRC_CONFIG_CRC_ENABLE_SIZE                     1
#define SI446X_PROP_PKT_FIELD_4_CRC_CONFIG_CRC_ENABLE_LSB                      1
#define SI446X_PROP_PKT_FIELD_4_CRC_CONFIG_CRC_ENABLE_MSB                      1
#define SI446X_PROP_PKT_FIELD_4_CRC_CONFIG_CRC_ENABLE_MASK                     0x2
#define SI446X_PROP_PKT_FIELD_4_CRC_CONFIG_CRC_ENABLE_BIT                      0x2

